{"config": {"input_layers": [["center_img", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 3, 160, 320], "name": "center_img"}, "name": "center_img"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["center_img", 0, 0]]], "config": {"trainable": true, "name": "batchnormalization_1", "gamma_regularizer": null, "epsilon": 0.001, "mode": 0, "momentum": 0.99, "beta_regularizer": null, "axis": -1}, "name": "batchnormalization_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 7, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "name": "conv1", "b_constraint": null, "nb_row": 7, "nb_filter": 96, "bias": true, "dim_ordering": "tf"}, "name": "conv1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv1", 0, 0]]], "config": {"trainable": true, "border_mode": "same", "strides": [2, 2], "name": "maxpool1", "pool_size": [3, 3], "dim_ordering": "tf"}, "name": "maxpool1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpool1", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire2_squeeze", "b_constraint": null, "nb_row": 1, "nb_filter": 16, "bias": true, "dim_ordering": "tf"}, "name": "fire2_squeeze"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire2_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire2_expand1", "b_constraint": null, "nb_row": 1, "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "name": "fire2_expand1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire2_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 3, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire2_expand2", "b_constraint": null, "nb_row": 3, "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "name": "fire2_expand2"}, {"class_name": "Merge", "inbound_nodes": [[["fire2_expand1", 0, 0], ["fire2_expand2", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "name": "merge_1"}, "name": "merge_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire3_squeeze", "b_constraint": null, "nb_row": 1, "nb_filter": 16, "bias": true, "dim_ordering": "tf"}, "name": "fire3_squeeze"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire3_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire3_expand1", "b_constraint": null, "nb_row": 1, "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "name": "fire3_expand1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire3_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 3, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire3_expand2", "b_constraint": null, "nb_row": 3, "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "name": "fire3_expand2"}, {"class_name": "Merge", "inbound_nodes": [[["fire3_expand1", 0, 0], ["fire3_expand2", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "name": "merge_2"}, "name": "merge_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire4_squeeze", "b_constraint": null, "nb_row": 1, "nb_filter": 32, "bias": true, "dim_ordering": "tf"}, "name": "fire4_squeeze"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire4_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire4_expand1", "b_constraint": null, "nb_row": 1, "nb_filter": 128, "bias": true, "dim_ordering": "tf"}, "name": "fire4_expand1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire4_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 3, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire4_expand2", "b_constraint": null, "nb_row": 3, "nb_filter": 128, "bias": true, "dim_ordering": "tf"}, "name": "fire4_expand2"}, {"class_name": "Merge", "inbound_nodes": [[["fire4_expand1", 0, 0], ["fire4_expand2", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "name": "merge_3"}, "name": "merge_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["merge_3", 0, 0]]], "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpool4", "pool_size": [3, 3], "dim_ordering": "tf"}, "name": "maxpool4"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpool4", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire5_squeeze", "b_constraint": null, "nb_row": 1, "nb_filter": 32, "bias": true, "dim_ordering": "tf"}, "name": "fire5_squeeze"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire5_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire5_expand1", "b_constraint": null, "nb_row": 1, "nb_filter": 128, "bias": true, "dim_ordering": "tf"}, "name": "fire5_expand1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire5_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 3, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire5_expand2", "b_constraint": null, "nb_row": 3, "nb_filter": 128, "bias": true, "dim_ordering": "tf"}, "name": "fire5_expand2"}, {"class_name": "Merge", "inbound_nodes": [[["fire5_expand1", 0, 0], ["fire5_expand2", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "name": "merge_4"}, "name": "merge_4"}, {"class_name": "Convolution2D", "inbound_nodes": [[["merge_4", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire6_squeeze", "b_constraint": null, "nb_row": 1, "nb_filter": 48, "bias": true, "dim_ordering": "tf"}, "name": "fire6_squeeze"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire6_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire6_expand1", "b_constraint": null, "nb_row": 1, "nb_filter": 192, "bias": true, "dim_ordering": "tf"}, "name": "fire6_expand1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire6_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 3, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire6_expand2", "b_constraint": null, "nb_row": 3, "nb_filter": 192, "bias": true, "dim_ordering": "tf"}, "name": "fire6_expand2"}, {"class_name": "Merge", "inbound_nodes": [[["fire6_expand1", 0, 0], ["fire6_expand2", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "name": "merge_5"}, "name": "merge_5"}, {"class_name": "Convolution2D", "inbound_nodes": [[["merge_5", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire7_squeeze", "b_constraint": null, "nb_row": 1, "nb_filter": 48, "bias": true, "dim_ordering": "tf"}, "name": "fire7_squeeze"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire7_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire7_expand1", "b_constraint": null, "nb_row": 1, "nb_filter": 192, "bias": true, "dim_ordering": "tf"}, "name": "fire7_expand1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire7_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 3, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire7_expand2", "b_constraint": null, "nb_row": 3, "nb_filter": 192, "bias": true, "dim_ordering": "tf"}, "name": "fire7_expand2"}, {"class_name": "Merge", "inbound_nodes": [[["fire7_expand1", 0, 0], ["fire7_expand2", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "name": "merge_6"}, "name": "merge_6"}, {"class_name": "Convolution2D", "inbound_nodes": [[["merge_6", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire8_squeeze", "b_constraint": null, "nb_row": 1, "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "name": "fire8_squeeze"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire8_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire8_expand1", "b_constraint": null, "nb_row": 1, "nb_filter": 256, "bias": true, "dim_ordering": "tf"}, "name": "fire8_expand1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire8_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 3, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire8_expand2", "b_constraint": null, "nb_row": 3, "nb_filter": 256, "bias": true, "dim_ordering": "tf"}, "name": "fire8_expand2"}, {"class_name": "Merge", "inbound_nodes": [[["fire8_expand1", 0, 0], ["fire8_expand2", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "name": "merge_7"}, "name": "merge_7"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["merge_7", 0, 0]]], "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpool8", "pool_size": [3, 3], "dim_ordering": "tf"}, "name": "maxpool8"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpool8", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire9_squeeze", "b_constraint": null, "nb_row": 1, "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "name": "fire9_squeeze"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire9_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 1, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire9_expand1", "b_constraint": null, "nb_row": 1, "nb_filter": 256, "bias": true, "dim_ordering": "tf"}, "name": "fire9_expand1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire9_squeeze", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "same", "nb_col": 3, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "fire9_expand2", "b_constraint": null, "nb_row": 3, "nb_filter": 256, "bias": true, "dim_ordering": "tf"}, "name": "fire9_expand2"}, {"class_name": "Merge", "inbound_nodes": [[["fire9_expand1", 0, 0], ["fire9_expand2", 0, 0]]], "config": {"concat_axis": 1, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "mode": "concat", "dot_axes": -1, "mode_type": "raw", "name": "merge_8"}, "name": "merge_8"}, {"class_name": "Dropout", "inbound_nodes": [[["merge_8", 0, 0]]], "config": {"trainable": true, "p": 0.5, "name": "fire9_dropout"}, "name": "fire9_dropout"}, {"class_name": "Convolution2D", "inbound_nodes": [[["fire9_dropout", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "border_mode": "valid", "nb_col": 1, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "conv10", "b_constraint": null, "nb_row": 1, "nb_filter": 10, "bias": true, "dim_ordering": "tf"}, "name": "conv10"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["conv10", 0, 0]]], "config": {"trainable": true, "border_mode": "same", "strides": [13, 13], "name": "avgpool10", "pool_size": [13, 13], "dim_ordering": "tf"}, "name": "avgpool10"}, {"class_name": "Flatten", "inbound_nodes": [[["avgpool10", 0, 0]]], "config": {"trainable": true, "name": "flatten"}, "name": "flatten"}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0]]], "config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "steering_output", "input_dim": 40, "bias": true, "output_dim": 1, "b_constraint": null}, "name": "steering_output"}], "output_layers": [["steering_output", 0, 0]]}, "class_name": "Model", "keras_version": "1.2.1"}