{"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "images", "config": {"input_dtype": "float32", "name": "images", "batch_input_shape": [null, 3, 90, 320], "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["images", 0, 0]]], "name": "batchnormalization_1", "config": {"beta_regularizer": null, "name": "batchnormalization_1", "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "convolution2d_1", "config": {"dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_1", "nb_row": 5, "nb_col": 5, "nb_filter": 3, "border_mode": "same", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "elu_1", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_1", 0, 0]]], "name": "convolution2d_2", "config": {"dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_2", "nb_row": 5, "nb_col": 5, "nb_filter": 24, "border_mode": "same", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "elu_2", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_2", 0, 0]]], "name": "convolution2d_3", "config": {"dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_3", "nb_row": 5, "nb_col": 5, "nb_filter": 36, "border_mode": "same", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "elu_3", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_3", 0, 0]]], "name": "convolution2d_4", "config": {"dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "nb_col": 3, "nb_filter": 48, "border_mode": "same", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "elu_4", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_4", 0, 0]]], "name": "dropout_1", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_5", "config": {"dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_5", "nb_row": 3, "nb_col": 3, "nb_filter": 64, "border_mode": "same", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "elu_5", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"inbound_nodes": [[["elu_5", 0, 0]]], "name": "dropout_2", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "config": {"W_regularizer": null, "name": "dense_1", "W_constraint": null, "b_regularizer": null, "input_dim": 17280, "output_dim": 512, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_3", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "dense_2", "config": {"W_regularizer": null, "name": "dense_2", "W_constraint": null, "b_regularizer": null, "input_dim": 512, "output_dim": 100, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "dropout_4", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "name": "dense_3", "config": {"W_regularizer": null, "name": "dense_3", "W_constraint": null, "b_regularizer": null, "input_dim": 100, "output_dim": 50, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "dropout_5", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_5", 0, 0]]], "name": "dense_4", "config": {"W_regularizer": null, "name": "dense_4", "W_constraint": null, "b_regularizer": null, "input_dim": 50, "output_dim": 1, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_4", 0, 0]]], "name": "steering_output", "config": {"W_regularizer": null, "name": "steering_output", "W_constraint": null, "b_regularizer": null, "input_dim": 1, "output_dim": 1, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null}, "class_name": "Dense"}], "name": "model_1", "output_layers": [["steering_output", 0, 0]], "input_layers": [["images", 0, 0]]}, "keras_version": "1.2.1"}