{"keras_version": "2.0.2", "config": {"layers": [{"config": {"batch_input_shape": [null, 120, 120, 3], "sparse": false, "dtype": "float32", "name": "images"}, "inbound_nodes": [], "name": "images", "class_name": "InputLayer"}, {"config": {"trainable": true, "output_shape": null, "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>]\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}, "inbound_nodes": [[["images", 0, 0, {}]]], "name": "lambda_1", "class_name": "Lambda"}, {"config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "name": "conv2d_1", "kernel_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "filters": 24, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "spatial_dropout2d_1", "class_name": "SpatialDropout2D"}, {"config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "name": "conv2d_2", "kernel_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "filters": 36, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["spatial_dropout2d_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "spatial_dropout2d_2", "class_name": "SpatialDropout2D"}, {"config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "name": "conv2d_3", "kernel_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "filters": 48, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["spatial_dropout2d_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "spatial_dropout2d_3", "class_name": "SpatialDropout2D"}, {"config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "name": "conv2d_4", "kernel_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["spatial_dropout2d_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "spatial_dropout2d_4", "class_name": "SpatialDropout2D"}, {"config": {"padding": "same", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "name": "conv2d_5", "kernel_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["spatial_dropout2d_4", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "spatial_dropout2d_5", "class_name": "SpatialDropout2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["spatial_dropout2d_5", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "units": 100, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "elu", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "units": 50, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "trainable": true, "name": "dense_3", "kernel_regularizer": null, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "steering_output", "kernel_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "steering_output", "class_name": "Dense"}], "output_layers": [["steering_output", 0, 0]], "name": "model_1", "input_layers": [["images", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}