{"keras_version": "2.0.2", "class_name": "Model", "config": {"output_layers": [["steering_output", 0, 0]], "name": "model_1", "layers": [{"name": "images", "config": {"name": "images", "sparse": false, "batch_input_shape": [null, 80, 80, 3], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "lambda_1", "config": {"arguments": {}, "trainable": true, "name": "lambda_1", "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0001\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null]}, "inbound_nodes": [[["images", 0, 0, {}]]], "class_name": "Lambda"}, {"name": "conv2d_1", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_1", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [5, 5], "strides": [2, 2], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_1", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_1", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_2", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_2", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [5, 5], "strides": [2, 2], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_2", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_2", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "ELU"}, {"name": "average_pooling2d_1", "config": {"pool_size": [4, 4], "padding": "same", "data_format": "channels_last", "trainable": true, "name": "average_pooling2d_1", "strides": [2, 2]}, "inbound_nodes": [[["elu_2", 0, 0, {}]]], "class_name": "AveragePooling2D"}, {"name": "conv2d_3", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_3", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_3", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_3", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_1", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_3", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_4", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_4", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_4", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_4", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_5", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_5", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_5", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_5", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_2", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_6", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_6", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_6", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_6", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_7", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_7", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_6", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_7", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_7", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_8", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_8", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_8", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_8", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_3", "config": {"name": "dropout_3", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_8", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_9", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_9", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_3", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_9", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_9", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "ELU"}, {"name": "elu_10", "config": {"name": "elu_10", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["elu_9", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_10", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_10", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_10", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_10", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_11", "config": {"name": "elu_11", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_4", "config": {"name": "dropout_4", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_11", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_11", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_11", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_4", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_11", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_12", "config": {"name": "elu_12", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_12", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_12", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_12", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_12", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_13", "config": {"name": "elu_13", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_5", "config": {"name": "dropout_5", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_13", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_13", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_13", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_5", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_13", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_14", "config": {"name": "elu_14", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_14", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_14", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_14", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_14", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_15", "config": {"name": "elu_15", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_6", "config": {"name": "dropout_6", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_15", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_15", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_15", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_6", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}], ["elu_14", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_15", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_16", "config": {"name": "elu_16", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_16", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_16", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_16", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_16", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_17", "config": {"name": "elu_17", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_7", "config": {"name": "dropout_7", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_17", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_17", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_17", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_7", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["elu_16", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_17", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_17", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_18", "config": {"name": "elu_18", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_18", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_18", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_18", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_18", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_18", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_19", "config": {"name": "elu_19", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_8", "config": {"name": "dropout_8", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_19", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_19", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_19", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_8", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["elu_18", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_19", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_20", "config": {"name": "elu_20", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_20", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_20", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_20", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_20", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_21", "config": {"name": "elu_21", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_9", "config": {"name": "dropout_9", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_21", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_21", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_21", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_9", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["elu_20", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_21", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_21", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_22", "config": {"name": "elu_22", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_22", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "name": "conv2d_22", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_22", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_22", "config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "trainable": true, "name": "batch_normalization_22", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_23", "config": {"name": "elu_23", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "ELU"}, {"name": "average_pooling2d_2", "config": {"pool_size": [4, 4], "padding": "valid", "data_format": "channels_last", "trainable": true, "name": "average_pooling2d_2", "strides": [2, 2]}, "inbound_nodes": [[["elu_23", 0, 0, {}]]], "class_name": "AveragePooling2D"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"activation": "elu", "trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1164, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_2", "config": {"activation": "linear", "trainable": true, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_3", "config": {"activation": "linear", "trainable": true, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_4", "config": {"activation": "linear", "trainable": true, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "normal"}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_5", "config": {"activation": "linear", "trainable": true, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense"}, {"name": "steering_output", "config": {"activation": "linear", "trainable": true, "name": "steering_output", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["images", 0, 0]]}, "backend": "tensorflow"}