{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.2", "config": {"output_layers": [["steering_output", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "images", "config": {"dtype": "float32", "batch_input_shape": [null, 80, 80, 3], "sparse": false, "name": "images"}}, {"inbound_nodes": [[["images", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_1", "config": {"function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "name": "lambda_1", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>A\u0001\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true}}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"filters": 32, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_1", "strides": [2, 2], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "ELU", "name": "elu_1", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"inbound_nodes": [[["elu_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"filters": 32, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_2", "strides": [2, 2], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "ELU", "name": "elu_2", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"inbound_nodes": [[["elu_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"data_format": "channels_last", "padding": "same", "name": "average_pooling2d_1", "strides": [2, 2], "pool_size": [4, 4], "trainable": true}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"filters": 32, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_3", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "ELU", "name": "elu_3", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"inbound_nodes": [[["elu_3", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"filters": 32, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_4", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]], "class_name": "Add", "name": "add_1", "config": {"name": "add_1", "trainable": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_4", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "ELU", "name": "elu_4", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"inbound_nodes": [[["elu_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"filters": 32, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_5", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_5", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "ELU", "name": "elu_5", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"inbound_nodes": [[["elu_5", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"filters": 32, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_6", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]], "class_name": "Add", "name": "add_2", "config": {"name": "add_2", "trainable": true}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_6", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "ELU", "name": "elu_6", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"inbound_nodes": [[["elu_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_7", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_7", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "ELU", "name": "elu_7", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"inbound_nodes": [[["elu_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_8", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_8", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "ELU", "name": "elu_8", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"inbound_nodes": [[["elu_8", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_9", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]], "class_name": "Add", "name": "add_3", "config": {"name": "add_3", "trainable": true}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_9", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "ELU", "name": "elu_9", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"inbound_nodes": [[["elu_9", 0, 0, {}]]], "class_name": "ELU", "name": "elu_10", "config": {"alpha": 1.0, "name": "elu_10", "trainable": true}}, {"inbound_nodes": [[["elu_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_10", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_10", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "ELU", "name": "elu_11", "config": {"alpha": 1.0, "name": "elu_11", "trainable": true}}, {"inbound_nodes": [[["elu_11", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "rate": 0.5}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_11", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]], "class_name": "Add", "name": "add_4", "config": {"name": "add_4", "trainable": true}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_11", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "ELU", "name": "elu_12", "config": {"alpha": 1.0, "name": "elu_12", "trainable": true}}, {"inbound_nodes": [[["elu_12", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_12", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_12", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "ELU", "name": "elu_13", "config": {"alpha": 1.0, "name": "elu_13", "trainable": true}}, {"inbound_nodes": [[["elu_13", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "rate": 0.5}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_13", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]], "class_name": "Add", "name": "add_5", "config": {"name": "add_5", "trainable": true}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_13", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "ELU", "name": "elu_14", "config": {"alpha": 1.0, "name": "elu_14", "trainable": true}}, {"inbound_nodes": [[["elu_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_14", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_14", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "ELU", "name": "elu_15", "config": {"alpha": 1.0, "name": "elu_15", "trainable": true}}, {"inbound_nodes": [[["elu_15", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_6", "config": {"trainable": true, "name": "dropout_6", "rate": 0.5}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_15", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}], ["elu_14", 0, 0, {}]]], "class_name": "Add", "name": "add_6", "config": {"name": "add_6", "trainable": true}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_15", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "ELU", "name": "elu_16", "config": {"alpha": 1.0, "name": "elu_16", "trainable": true}}, {"inbound_nodes": [[["elu_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_16", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_16", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "ELU", "name": "elu_17", "config": {"alpha": 1.0, "name": "elu_17", "trainable": true}}, {"inbound_nodes": [[["elu_17", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_7", "config": {"trainable": true, "name": "dropout_7", "rate": 0.5}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_17", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}], ["elu_16", 0, 0, {}]]], "class_name": "Add", "name": "add_7", "config": {"name": "add_7", "trainable": true}}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_17", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "ELU", "name": "elu_18", "config": {"alpha": 1.0, "name": "elu_18", "trainable": true}}, {"inbound_nodes": [[["elu_18", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_18", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_18", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "ELU", "name": "elu_19", "config": {"alpha": 1.0, "name": "elu_19", "trainable": true}}, {"inbound_nodes": [[["elu_19", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_8", "config": {"trainable": true, "name": "dropout_8", "rate": 0.5}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_19", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}], ["elu_18", 0, 0, {}]]], "class_name": "Add", "name": "add_8", "config": {"name": "add_8", "trainable": true}}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_19", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "ELU", "name": "elu_20", "config": {"alpha": 1.0, "name": "elu_20", "trainable": true}}, {"inbound_nodes": [[["elu_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_20", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_20", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "ELU", "name": "elu_21", "config": {"alpha": 1.0, "name": "elu_21", "trainable": true}}, {"inbound_nodes": [[["elu_21", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_9", "config": {"trainable": true, "name": "dropout_9", "rate": 0.5}}, {"inbound_nodes": [[["dropout_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"filters": 64, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_21", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}], ["elu_20", 0, 0, {}]]], "class_name": "Add", "name": "add_9", "config": {"name": "add_9", "trainable": true}}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_21", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "ELU", "name": "elu_22", "config": {"alpha": 1.0, "name": "elu_22", "trainable": true}}, {"inbound_nodes": [[["elu_22", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22", "config": {"filters": 256, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "name": "conv2d_22", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_22", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "ELU", "name": "elu_23", "config": {"alpha": 1.0, "name": "elu_23", "trainable": true}}, {"inbound_nodes": [[["elu_23", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"data_format": "channels_last", "padding": "valid", "name": "average_pooling2d_2", "strides": [2, 2], "pool_size": [4, 4], "trainable": true}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1164, "activation": "elu", "name": "dense_1", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "trainable": true, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activation": "linear", "name": "dense_2", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "trainable": true, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "activation": "linear", "name": "dense_3", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "trainable": true, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activation": "linear", "name": "dense_4", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "trainable": true, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_5", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activation": "linear", "name": "dense_5", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dense", "name": "steering_output", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activation": "linear", "name": "steering_output", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null}}], "input_layers": [["images", 0, 0]]}}