{"config": {"name": "model_1", "layers": [{"name": "images", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "images", "batch_input_shape": [null, 80, 80, 3], "dtype": "float32", "sparse": false}}, {"name": "lambda_1", "inbound_nodes": [[["images", 0, 0, {}]]], "class_name": "Lambda", "config": {"function_type": "lambda", "name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"name": "conv2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_1", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [2, 2], "filters": 32, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_1", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"name": "conv2d_2", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_2", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [2, 2], "filters": 32, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_2", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "pool_size": [4, 4], "padding": "same", "data_format": "channels_last", "strides": [2, 2], "trainable": true}}, {"name": "conv2d_3", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_3", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 32, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_3", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"name": "dropout_1", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"name": "conv2d_4", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_4", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 32, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "add_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "batch_normalization_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_4", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"name": "conv2d_5", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_5", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 32, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_5", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"name": "dropout_2", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"name": "conv2d_6", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_6", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 32, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "add_2", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"name": "batch_normalization_6", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_6", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"name": "conv2d_7", "inbound_nodes": [[["elu_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_7", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_7", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"name": "conv2d_8", "inbound_nodes": [[["elu_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_8", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_8", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"name": "dropout_3", "inbound_nodes": [[["elu_8", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}}, {"name": "conv2d_9", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_9", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "add_3", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"name": "batch_normalization_9", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_9", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"name": "elu_10", "inbound_nodes": [[["elu_9", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_10", "trainable": true}}, {"name": "conv2d_10", "inbound_nodes": [[["elu_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_10", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_10", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_11", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_11", "trainable": true}}, {"name": "dropout_4", "inbound_nodes": [[["elu_11", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.5}}, {"name": "conv2d_11", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_11", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "add_4", "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"name": "batch_normalization_11", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_11", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_12", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_12", "trainable": true}}, {"name": "conv2d_12", "inbound_nodes": [[["elu_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_12", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_12", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_13", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_13", "trainable": true}}, {"name": "dropout_5", "inbound_nodes": [[["elu_13", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.5}}, {"name": "conv2d_13", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_13", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "add_5", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_5", "trainable": true}}, {"name": "batch_normalization_13", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_13", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_14", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_14", "trainable": true}}, {"name": "conv2d_14", "inbound_nodes": [[["elu_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_14", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_14", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_15", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_15", "trainable": true}}, {"name": "dropout_6", "inbound_nodes": [[["elu_15", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.5}}, {"name": "conv2d_15", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_15", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "add_6", "inbound_nodes": [[["conv2d_15", 0, 0, {}], ["elu_14", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_6", "trainable": true}}, {"name": "batch_normalization_15", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_15", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_16", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_16", "trainable": true}}, {"name": "conv2d_16", "inbound_nodes": [[["elu_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_16", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_16", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_17", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_17", "trainable": true}}, {"name": "dropout_7", "inbound_nodes": [[["elu_17", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.5}}, {"name": "conv2d_17", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_17", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "add_7", "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["elu_16", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_7", "trainable": true}}, {"name": "batch_normalization_17", "inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_17", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_18", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_18", "trainable": true}}, {"name": "conv2d_18", "inbound_nodes": [[["elu_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_18", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_18", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_19", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_19", "trainable": true}}, {"name": "dropout_8", "inbound_nodes": [[["elu_19", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.5}}, {"name": "conv2d_19", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_19", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "add_8", "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["elu_18", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_8", "trainable": true}}, {"name": "batch_normalization_19", "inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_19", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_20", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_20", "trainable": true}}, {"name": "conv2d_20", "inbound_nodes": [[["elu_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_20", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_20", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_21", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_21", "trainable": true}}, {"name": "dropout_9", "inbound_nodes": [[["elu_21", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.5}}, {"name": "conv2d_21", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_21", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "add_9", "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["elu_20", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_9", "trainable": true}}, {"name": "batch_normalization_21", "inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_21", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_22", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_22", "trainable": true}}, {"name": "conv2d_22", "inbound_nodes": [[["elu_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_22", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "same", "trainable": true, "strides": [1, 1], "filters": 256, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_22", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"name": "elu_23", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_23", "trainable": true}}, {"name": "average_pooling2d_2", "inbound_nodes": [[["elu_23", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "pool_size": [4, 4], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}}, {"name": "flatten_1", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 1164, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "elu"}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 512, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "dense_3", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 100, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "dense_4", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 50, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activation": "linear"}}, {"name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_5", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "linear"}}, {"name": "steering_output", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "steering_output", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "linear"}}], "input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]]}, "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Model"}