{"keras_version": "1.2.1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "images", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 3, 90, 320], "name": "images", "input_dtype": "float32"}}, {"name": "batchnormalization_1", "inbound_nodes": [[["images", 0, 0]]], "class_name": "BatchNormalization", "config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "name": "batchnormalization_1", "axis": -1, "trainable": true, "beta_regularizer": null}}, {"name": "convolution2d_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "nb_row": 5, "b_constraint": null, "subsample": [1, 1], "trainable": true, "nb_col": 5, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_1", "nb_filter": 3, "bias": true, "activation": "linear"}}, {"name": "prelu_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "PReLU", "config": {"name": "prelu_1", "init": "zero", "trainable": true}}, {"name": "convolution2d_2", "inbound_nodes": [[["prelu_1", 0, 0]]], "class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "nb_row": 5, "b_constraint": null, "subsample": [1, 1], "trainable": true, "nb_col": 5, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_2", "nb_filter": 24, "bias": true, "activation": "linear"}}, {"name": "prelu_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "PReLU", "config": {"name": "prelu_2", "init": "zero", "trainable": true}}, {"name": "convolution2d_3", "inbound_nodes": [[["prelu_2", 0, 0]]], "class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "nb_row": 5, "b_constraint": null, "subsample": [1, 1], "trainable": true, "nb_col": 5, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_3", "nb_filter": 36, "bias": true, "activation": "linear"}}, {"name": "prelu_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "PReLU", "config": {"name": "prelu_3", "init": "zero", "trainable": true}}, {"name": "convolution2d_4", "inbound_nodes": [[["prelu_3", 0, 0]]], "class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "nb_row": 3, "b_constraint": null, "subsample": [1, 1], "trainable": true, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_4", "nb_filter": 48, "bias": true, "activation": "linear"}}, {"name": "prelu_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "PReLU", "config": {"name": "prelu_4", "init": "zero", "trainable": true}}, {"name": "convolution2d_5", "inbound_nodes": [[["prelu_4", 0, 0]]], "class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "nb_row": 3, "b_constraint": null, "subsample": [1, 1], "trainable": true, "nb_col": 3, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "prelu_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "PReLU", "config": {"name": "prelu_5", "init": "zero", "trainable": true}}, {"name": "dropout_1", "inbound_nodes": [[["prelu_5", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"name": "flatten_1", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1164, "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "input_dim": 17280, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_1", "activation": "linear"}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 100, "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "input_dim": 1164, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_2", "activation": "linear"}}, {"name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 50, "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "input_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_3", "activation": "linear"}}, {"name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 10, "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "input_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_4", "activation": "linear"}}, {"name": "steering_output", "inbound_nodes": [[["dense_4", 0, 0]]], "class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1, "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "input_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "steering_output", "activation": "linear"}}], "input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]]}}