{"class_name": "Model", "keras_version": "2.0.2", "config": {"input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "images", "config": {"sparse": false, "batch_input_shape": [null, 3, 80, 80], "name": "images", "dtype": "float32"}}, {"inbound_nodes": [[["images", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_1", "config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00bd\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda"}}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "filters": 32}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"name": "batch_normalization_1", "beta_constraint": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "ELU", "name": "elu_1", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"inbound_nodes": [[["elu_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "filters": 24}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"name": "batch_normalization_2", "beta_constraint": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "ELU", "name": "elu_2", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"inbound_nodes": [[["elu_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "name": "conv2d_3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "filters": 36}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"name": "batch_normalization_3", "beta_constraint": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "ELU", "name": "elu_3", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"inbound_nodes": [[["elu_3", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "name": "conv2d_4", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "filters": 24}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["elu_2", 0, 0, {}]]], "class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"name": "batch_normalization_4", "beta_constraint": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "ELU", "name": "elu_4", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"inbound_nodes": [[["elu_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "conv2d_5", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "filters": 64}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"name": "batch_normalization_5", "beta_constraint": null, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "ELU", "name": "elu_5", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"inbound_nodes": [[["elu_5", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"trainable": true, "padding": "valid", "pool_size": [4, 4], "data_format": "channels_first", "strides": [2, 2], "name": "average_pooling2d_1"}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1164, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "name": "dense_1"}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 512, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "name": "dense_2"}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 100, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "name": "dense_3"}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 50, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "normal"}}, "name": "dense_4"}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_5", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "dense_5"}}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dense", "name": "steering_output", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "steering_output"}}]}, "backend": "theano"}