{"class_name": "Model", "config": {"output_layers": [["steering_output", 0, 0]], "layers": [{"name": "images", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 120, 120, 3], "dtype": "float32", "sparse": false, "name": "images"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>]\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null}, "inbound_nodes": [[["images", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"padding": "same", "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "normal", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "strides": [2, 2], "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_1", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 5], "bias_regularizer": null, "filters": 24}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "spatial_dropout2d_1", "class_name": "SpatialDropout2D", "config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"padding": "same", "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "normal", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "strides": [2, 2], "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_2", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 5], "bias_regularizer": null, "filters": 36}, "inbound_nodes": [[["spatial_dropout2d_1", 0, 0, {}]]]}, {"name": "spatial_dropout2d_2", "class_name": "SpatialDropout2D", "config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"padding": "same", "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "normal", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "strides": [2, 2], "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_3", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 5], "bias_regularizer": null, "filters": 48}, "inbound_nodes": [[["spatial_dropout2d_2", 0, 0, {}]]]}, {"name": "spatial_dropout2d_3", "class_name": "SpatialDropout2D", "config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"padding": "same", "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "normal", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_4", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 5], "bias_regularizer": null, "filters": 64}, "inbound_nodes": [[["spatial_dropout2d_3", 0, 0, {}]]]}, {"name": "spatial_dropout2d_4", "class_name": "SpatialDropout2D", "config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"padding": "same", "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "normal", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "name": "conv2d_5", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 5], "bias_regularizer": null, "filters": 64}, "inbound_nodes": [[["spatial_dropout2d_4", 0, 0, {}]]]}, {"name": "spatial_dropout2d_5", "class_name": "SpatialDropout2D", "config": {"rate": 0.2, "trainable": true, "name": "spatial_dropout2d_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["spatial_dropout2d_5", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "normal", "scale": 1.0, "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 100, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "normal", "scale": 1.0, "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 50, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "normal", "scale": 1.0, "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 10, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "steering_output", "class_name": "Dense", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 1, "kernel_regularizer": null, "name": "steering_output", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["images", 0, 0]], "name": "model_1"}, "keras_version": "2.0.2", "backend": "tensorflow"}