{"class_name": "Model", "keras_version": "2.0.2", "config": {"input_layers": [["images", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "images", "config": {"dtype": "float32", "batch_input_shape": [null, 80, 80, 3], "sparse": false, "name": "images"}, "inbound_nodes": []}, {"class_name": "Lambda", "name": "lambda_1", "config": {"output_shape": null, "name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0001\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "trainable": true}, "inbound_nodes": [[["images", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_size": [5, 5], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [2, 2], "name": "conv2d_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_1", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_1", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_size": [5, 5], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [2, 2], "name": "conv2d_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_2", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_2", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"name": "average_pooling2d_1", "padding": "same", "pool_size": [4, 4], "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_size": [5, 5], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_3", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_3", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_3", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_size": [5, 5], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_4", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_4", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_4", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_size": [5, 5], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_5", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_5", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_5", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_size": [5, 5], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_6", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_6", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_6", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_size": [5, 5], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_7", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_7", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_7", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_8", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_8", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_8", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_9", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_9", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_9", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_10", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_10", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_10", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_11", "config": {"name": "elu_11", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_11", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_11", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_12", "config": {"name": "elu_12", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_12", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_12", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_13", "config": {"name": "elu_13", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"name": "dropout_5", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["elu_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_13", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_13", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_14", "config": {"name": "elu_14", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_14", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_14", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_15", "config": {"name": "elu_15", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"name": "dropout_6", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["elu_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_15", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}], ["elu_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_15", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_16", "config": {"name": "elu_16", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_16", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_16", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_17", "config": {"name": "elu_17", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_7", "config": {"name": "dropout_7", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["elu_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_17", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["elu_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_17", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_18", "config": {"name": "elu_18", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_18", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_18", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_19", "config": {"name": "elu_19", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_8", "config": {"name": "dropout_8", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["elu_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_19", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["elu_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_19", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_20", "config": {"name": "elu_20", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_20", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_20", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_21", "config": {"name": "elu_21", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_9", "config": {"name": "dropout_9", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["elu_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_21", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["elu_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_21", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_22", "config": {"name": "elu_22", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "kernel_regularizer": null, "strides": [1, 1], "name": "conv2d_22", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "filters": 256, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["elu_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_22", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_23", "config": {"name": "elu_23", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"name": "average_pooling2d_2", "padding": "valid", "pool_size": [4, 4], "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["elu_23", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu", "units": 1164, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 512, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_3", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 100, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_4", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 50, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}}, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_5", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "steering_output", "config": {"kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "steering_output", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "output_layers": [["steering_output", 0, 0]]}, "backend": "tensorflow"}