{"keras_version": "1.2.1", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["images", 0, 0]], "layers": [{"name": "images", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "images", "batch_input_shape": [null, 3, 160, 320], "input_dtype": "float32"}}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["images", 0, 0]]], "config": {"axis": -1, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_1", "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001}}, {"name": "conv1", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 7, "name": "conv1", "nb_filter": 96, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [2, 2], "trainable": true, "activity_regularizer": null, "nb_row": 7, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "maxpool1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv1", 0, 0]]], "config": {"pool_size": [3, 3], "border_mode": "same", "trainable": true, "name": "maxpool1", "dim_ordering": "tf", "strides": [2, 2]}}, {"name": "fire2_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["maxpool1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire2_squeeze", "nb_filter": 16, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire2_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire2_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire2_expand1", "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire2_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire2_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 3, "name": "fire2_expand2", "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["fire2_expand1", 0, 0], ["fire2_expand2", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 1, "name": "merge_1", "arguments": {}, "output_mask_type": "raw", "output_shape": null}}, {"name": "fire3_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire3_squeeze", "nb_filter": 16, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire3_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire3_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire3_expand1", "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire3_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire3_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 3, "name": "fire3_expand2", "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "merge_2", "class_name": "Merge", "inbound_nodes": [[["fire3_expand1", 0, 0], ["fire3_expand2", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 1, "name": "merge_2", "arguments": {}, "output_mask_type": "raw", "output_shape": null}}, {"name": "fire4_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire4_squeeze", "nb_filter": 32, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire4_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire4_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire4_expand1", "nb_filter": 128, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire4_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire4_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 3, "name": "fire4_expand2", "nb_filter": 128, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "merge_3", "class_name": "Merge", "inbound_nodes": [[["fire4_expand1", 0, 0], ["fire4_expand2", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 1, "name": "merge_3", "arguments": {}, "output_mask_type": "raw", "output_shape": null}}, {"name": "maxpool4", "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_3", 0, 0]]], "config": {"pool_size": [3, 3], "border_mode": "valid", "trainable": true, "name": "maxpool4", "dim_ordering": "tf", "strides": [2, 2]}}, {"name": "fire5_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["maxpool4", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire5_squeeze", "nb_filter": 32, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire5_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire5_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire5_expand1", "nb_filter": 128, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire5_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire5_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 3, "name": "fire5_expand2", "nb_filter": 128, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "merge_4", "class_name": "Merge", "inbound_nodes": [[["fire5_expand1", 0, 0], ["fire5_expand2", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 1, "name": "merge_4", "arguments": {}, "output_mask_type": "raw", "output_shape": null}}, {"name": "fire6_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_4", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire6_squeeze", "nb_filter": 48, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire6_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire6_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire6_expand1", "nb_filter": 192, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire6_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire6_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 3, "name": "fire6_expand2", "nb_filter": 192, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "merge_5", "class_name": "Merge", "inbound_nodes": [[["fire6_expand1", 0, 0], ["fire6_expand2", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 1, "name": "merge_5", "arguments": {}, "output_mask_type": "raw", "output_shape": null}}, {"name": "fire7_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_5", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire7_squeeze", "nb_filter": 48, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire7_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire7_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire7_expand1", "nb_filter": 192, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire7_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire7_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 3, "name": "fire7_expand2", "nb_filter": 192, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "merge_6", "class_name": "Merge", "inbound_nodes": [[["fire7_expand1", 0, 0], ["fire7_expand2", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 1, "name": "merge_6", "arguments": {}, "output_mask_type": "raw", "output_shape": null}}, {"name": "fire8_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_6", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire8_squeeze", "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire8_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire8_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire8_expand1", "nb_filter": 256, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire8_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire8_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 3, "name": "fire8_expand2", "nb_filter": 256, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "merge_7", "class_name": "Merge", "inbound_nodes": [[["fire8_expand1", 0, 0], ["fire8_expand2", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 1, "name": "merge_7", "arguments": {}, "output_mask_type": "raw", "output_shape": null}}, {"name": "maxpool8", "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_7", 0, 0]]], "config": {"pool_size": [3, 3], "border_mode": "valid", "trainable": true, "name": "maxpool8", "dim_ordering": "tf", "strides": [2, 2]}}, {"name": "fire9_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["maxpool8", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire9_squeeze", "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire9_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire9_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "fire9_expand1", "nb_filter": 256, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "fire9_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire9_squeeze", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 3, "name": "fire9_expand2", "nb_filter": 256, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null}}, {"name": "merge_8", "class_name": "Merge", "inbound_nodes": [[["fire9_expand1", 0, 0], ["fire9_expand2", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 1, "name": "merge_8", "arguments": {}, "output_mask_type": "raw", "output_shape": null}}, {"name": "fire9_dropout", "class_name": "Dropout", "inbound_nodes": [[["merge_8", 0, 0]]], "config": {"name": "fire9_dropout", "p": 0.5, "trainable": true}}, {"name": "conv10", "class_name": "Convolution2D", "inbound_nodes": [[["fire9_dropout", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "nb_col": 1, "name": "conv10", "nb_filter": 10, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 1, "bias": true, "activation": "linear", "b_regularizer": null}}, {"name": "avgpool10", "class_name": "AveragePooling2D", "inbound_nodes": [[["conv10", 0, 0]]], "config": {"pool_size": [13, 13], "border_mode": "same", "trainable": true, "name": "avgpool10", "dim_ordering": "tf", "strides": [13, 13]}}, {"name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["avgpool10", 0, 0]]], "config": {"name": "flatten", "trainable": true}}, {"name": "steering_output", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "steering_output", "init": "glorot_uniform", "input_dim": 40, "output_dim": 1, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null}}], "output_layers": [["steering_output", 0, 0]]}}