{"backend": "tensorflow", "keras_version": "2.0.2", "config": {"output_layers": [["steering_output", 0, 0]], "layers": [{"name": "images", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "images", "batch_input_shape": [null, 80, 80, 3], "sparse": false}}, {"name": "lambda_1", "inbound_nodes": [[["images", 0, 0, {}]]], "class_name": "Lambda", "config": {"name": "lambda_1", "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00ea\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "arguments": {}, "output_shape": null}}, {"name": "conv2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [2, 2], "filters": 32, "use_bias": true}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_1", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_2", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [2, 2], "filters": 32, "use_bias": true}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_2", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "same", "name": "average_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [4, 4]}}, {"name": "conv2d_3", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 32, "use_bias": true}}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_3", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"name": "dropout_1", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_1", "trainable": true}}, {"name": "conv2d_4", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 32, "use_bias": true}}, {"name": "add_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "batch_normalization_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_4", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_5", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_5", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 32, "use_bias": true}}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_5", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"name": "dropout_2", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}}, {"name": "conv2d_6", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_6", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 32, "use_bias": true}}, {"name": "add_2", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"name": "batch_normalization_6", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_6", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_7", "inbound_nodes": [[["elu_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_7", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 64, "use_bias": true}}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_7", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_8", "inbound_nodes": [[["elu_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_8", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 64, "use_bias": true}}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_8", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"name": "dropout_3", "inbound_nodes": [[["elu_8", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_3", "trainable": true}}, {"name": "conv2d_9", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_9", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 64, "use_bias": true}}, {"name": "add_3", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"name": "batch_normalization_9", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_9", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"name": "elu_10", "inbound_nodes": [[["elu_9", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_10", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_10", "inbound_nodes": [[["elu_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_10", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 64, "use_bias": true}}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_10", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_11", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_11", "alpha": 1.0, "trainable": true}}, {"name": "dropout_4", "inbound_nodes": [[["elu_11", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_4", "trainable": true}}, {"name": "conv2d_11", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_11", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 64, "use_bias": true}}, {"name": "add_4", "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"name": "batch_normalization_11", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_11", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_12", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_12", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_12", "inbound_nodes": [[["elu_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_12", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "strides": [1, 1], "filters": 256, "use_bias": true}}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "name": "batch_normalization_12", "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}}, {"name": "elu_13", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_13", "alpha": 1.0, "trainable": true}}, {"name": "average_pooling2d_2", "inbound_nodes": [[["elu_13", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "valid", "name": "average_pooling2d_2", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [4, 4]}}, {"name": "flatten_1", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 1164, "name": "dense_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "elu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 512, "name": "dense_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 100, "name": "dense_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 50, "name": "dense_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 1, "name": "dense_5", "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "steering_output", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 1, "name": "steering_output", "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}], "input_layers": [["images", 0, 0]], "name": "model_1"}, "class_name": "Model"}