{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "images", "class_name": "InputLayer", "config": {"name": "images", "dtype": "float32", "batch_input_shape": [null, 80, 80, 3], "sparse": false}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00ea\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "arguments": {}, "trainable": true}, "inbound_nodes": [[["images", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [2, 2]}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "elu_1", "class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [2, 2]}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "elu_2", "class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "pool_size": [4, 4], "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "elu_3", "class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "elu_4", "class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "elu_5", "class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "elu_6", "class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "elu_7", "class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "elu_8", "class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "elu_9", "class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "elu_10", "class_name": "ELU", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "elu_11", "class_name": "ELU", "config": {"name": "elu_11", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "elu_12", "class_name": "ELU", "config": {"name": "elu_12", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "data_format": "channels_last", "activation": "linear", "bias_constraint": null, "strides": [1, 1]}, "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "elu_13", "class_name": "ELU", "config": {"name": "elu_13", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "pool_size": [4, 4], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["elu_13", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "units": 1164, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "activation": "elu", "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "units": 512, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "activation": "linear", "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "units": 100, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "activation": "linear", "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "units": 50, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "normal"}}, "activation": "linear", "bias_constraint": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "tanh", "bias_constraint": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "steering_output", "class_name": "Dense", "config": {"name": "steering_output", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "bias_constraint": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]]}}