{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 80, 80, 3], "dtype": "float32", "name": "images", "sparse": false}, "name": "images", "class_name": "InputLayer"}, {"inbound_nodes": [[["images", 0, 0, {}]]], "config": {"trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00f6\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "output_shape": null}, "name": "lambda_1", "class_name": "Lambda"}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null}, "name": "conv2d_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_1", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "name": "elu_1", "class_name": "ELU"}, {"inbound_nodes": [[["elu_1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_2", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null}, "name": "conv2d_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_2", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "name": "elu_2", "class_name": "ELU"}, {"inbound_nodes": [[["elu_2", 0, 0, {}]]], "config": {"pool_size": [4, 4], "trainable": true, "data_format": "channels_last", "name": "average_pooling2d_1", "strides": [2, 2], "padding": "same"}, "name": "average_pooling2d_1", "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_3", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_3", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "name": "elu_3", "class_name": "ELU"}, {"inbound_nodes": [[["elu_3", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_4", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_4", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "class_name": "Add"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_4", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "name": "elu_4", "class_name": "ELU"}, {"inbound_nodes": [[["elu_4", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_5", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_5", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_5", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "name": "elu_5", "class_name": "ELU"}, {"inbound_nodes": [[["elu_5", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "name": "dropout_2", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_6", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_6", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "class_name": "Add"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_6", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "name": "elu_6", "class_name": "ELU"}, {"inbound_nodes": [[["elu_6", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_7", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_7", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_7", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "name": "elu_7", "class_name": "ELU"}, {"inbound_nodes": [[["elu_7", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_8", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_8", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_8", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "name": "elu_8", "class_name": "ELU"}, {"inbound_nodes": [[["elu_8", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "name": "dropout_3", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_9", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_9", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "class_name": "Add"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_9", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}, "name": "elu_9", "class_name": "ELU"}, {"inbound_nodes": [[["elu_9", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_10", "alpha": 1.0}, "name": "elu_10", "class_name": "ELU"}, {"inbound_nodes": [[["elu_10", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_10", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_10", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_10", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_11", "alpha": 1.0}, "name": "elu_11", "class_name": "ELU"}, {"inbound_nodes": [[["elu_11", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_4", "rate": 0.5}, "name": "dropout_4", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_11", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_11", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "class_name": "Add"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_11", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_12", "alpha": 1.0}, "name": "elu_12", "class_name": "ELU"}, {"inbound_nodes": [[["elu_12", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_12", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_12", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_12", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_13", "alpha": 1.0}, "name": "elu_13", "class_name": "ELU"}, {"inbound_nodes": [[["elu_13", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_5", "rate": 0.5}, "name": "dropout_5", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_13", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_13", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]], "config": {"trainable": true, "name": "add_5"}, "name": "add_5", "class_name": "Add"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_13", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_14", "alpha": 1.0}, "name": "elu_14", "class_name": "ELU"}, {"inbound_nodes": [[["elu_14", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_14", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null}, "name": "conv2d_14", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_14", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_15", "alpha": 1.0}, "name": "elu_15", "class_name": "ELU"}, {"inbound_nodes": [[["elu_15", 0, 0, {}]]], "config": {"pool_size": [4, 4], "trainable": true, "data_format": "channels_last", "name": "average_pooling2d_2", "strides": [2, 2], "padding": "valid"}, "name": "average_pooling2d_2", "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"trainable": true, "units": 1164, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "name": "dense_1", "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"trainable": true, "units": 512, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "name": "dense_2", "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"trainable": true, "units": 100, "name": "dense_3", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "name": "dense_3", "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"trainable": true, "units": 50, "name": "dense_4", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "name": "dense_4", "class_name": "Dense"}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"trainable": true, "units": 1, "name": "dense_5", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "name": "dense_5", "class_name": "Dense"}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"trainable": true, "units": 1, "name": "steering_output", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "name": "steering_output", "class_name": "Dense"}], "input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]]}, "keras_version": "2.0.2"}