{"class_name": "Model", "keras_version": "1.2.1", "config": {"output_layers": [["steering_output", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 3, 90, 320], "name": "images", "sparse": false}, "name": "images", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "mode": 0, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "trainable": true, "axis": -1, "name": "batchnormalization_1"}, "name": "batchnormalization_1", "inbound_nodes": [[["images", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "border_mode": "same", "trainable": true, "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 3, "W_regularizer": null, "subsample": [1, 1]}, "name": "convolution2d_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "PReLU", "config": {"trainable": true, "name": "prelu_1", "init": "zero"}, "name": "prelu_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "border_mode": "same", "trainable": true, "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 24, "W_regularizer": null, "subsample": [1, 1]}, "name": "convolution2d_2", "inbound_nodes": [[["prelu_1", 0, 0]]]}, {"class_name": "PReLU", "config": {"trainable": true, "name": "prelu_2", "init": "zero"}, "name": "prelu_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "border_mode": "same", "trainable": true, "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 36, "W_regularizer": null, "subsample": [1, 1]}, "name": "convolution2d_3", "inbound_nodes": [[["prelu_2", 0, 0]]]}, {"class_name": "PReLU", "config": {"trainable": true, "name": "prelu_3", "init": "zero"}, "name": "prelu_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "border_mode": "same", "trainable": true, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "name": "convolution2d_4", "b_constraint": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 48, "W_regularizer": null, "subsample": [1, 1]}, "name": "convolution2d_4", "inbound_nodes": [[["prelu_3", 0, 0]]]}, {"class_name": "PReLU", "config": {"trainable": true, "name": "prelu_4", "init": "zero"}, "name": "prelu_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "linear", "border_mode": "same", "trainable": true, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "name": "convolution2d_5", "b_constraint": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1]}, "name": "convolution2d_5", "inbound_nodes": [[["prelu_4", 0, 0]]]}, {"class_name": "PReLU", "config": {"trainable": true, "name": "prelu_5", "init": "zero"}, "name": "prelu_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}, "name": "dropout_1", "inbound_nodes": [[["prelu_5", 0, 0]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "trainable": true, "input_dim": 17280, "init": "glorot_uniform", "name": "dense_1", "bias": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 1164, "W_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "trainable": true, "input_dim": 1164, "init": "glorot_uniform", "name": "dense_2", "bias": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 100, "W_regularizer": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "trainable": true, "input_dim": 100, "init": "glorot_uniform", "name": "dense_3", "bias": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 50, "W_regularizer": null}, "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "trainable": true, "input_dim": 50, "init": "glorot_uniform", "name": "dense_4", "bias": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 10, "W_regularizer": null}, "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "trainable": true, "input_dim": 10, "init": "glorot_uniform", "name": "steering_output", "bias": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 1, "W_regularizer": null}, "name": "steering_output", "inbound_nodes": [[["dense_4", 0, 0]]]}], "name": "model_1", "input_layers": [["images", 0, 0]]}}