{"keras_version": "1.2.1", "config": {"name": "model_1", "output_layers": [["steering_output", 0, 0], ["throttle_output", 0, 0], ["brake_output", 0, 0], ["speed_output", 0, 0]], "input_layers": [["left_img", 0, 0], ["center_img", 0, 0], ["right_img", 0, 0]], "layers": [{"name": "left_img", "class_name": "InputLayer", "config": {"name": "left_img", "batch_input_shape": [null, 3, 80, 160], "sparse": false, "input_dtype": "float32"}, "inbound_nodes": []}, {"name": "center_img", "class_name": "InputLayer", "config": {"name": "center_img", "batch_input_shape": [null, 3, 80, 160], "sparse": false, "input_dtype": "float32"}, "inbound_nodes": []}, {"name": "right_img", "class_name": "InputLayer", "config": {"name": "right_img", "batch_input_shape": [null, 3, 80, 160], "sparse": false, "input_dtype": "float32"}, "inbound_nodes": []}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"mode": 0, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "name": "batchnormalization_1", "trainable": true, "beta_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["left_img", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"mode": 0, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "name": "batchnormalization_3", "trainable": true, "beta_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["center_img", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"mode": 0, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "name": "batchnormalization_2", "trainable": true, "beta_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["right_img", 0, 0]]]}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_1", "trainable": true, "border_mode": "same", "init": "glorot_uniform", "W_constraint": null, "bias": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 32, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_3", "trainable": true, "border_mode": "same", "init": "glorot_uniform", "W_constraint": null, "bias": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 32, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_2", "trainable": true, "border_mode": "same", "init": "glorot_uniform", "W_constraint": null, "bias": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 32, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "prelu_1", "class_name": "PReLU", "config": {"name": "prelu_1", "trainable": true, "init": "zero"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "prelu_3", "class_name": "PReLU", "config": {"name": "prelu_3", "trainable": true, "init": "zero"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "prelu_2", "class_name": "PReLU", "config": {"name": "prelu_2", "trainable": true, "init": "zero"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "inbound_nodes": [[["prelu_1", 0, 0]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.25}, "inbound_nodes": [[["prelu_3", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}, "inbound_nodes": [[["prelu_2", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "output_mask": null, "mode": "concat", "name": "merge_1", "mode_type": "raw", "output_shape_type": "raw", "concat_axis": -1, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["dropout_1", 0, 0], ["dropout_3", 0, 0], ["dropout_2", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_4", "trainable": true, "border_mode": "same", "init": "glorot_uniform", "W_constraint": null, "bias": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 3, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "prelu_4", "class_name": "PReLU", "config": {"name": "prelu_4", "trainable": true, "init": "zero"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_5", "trainable": true, "border_mode": "same", "init": "glorot_uniform", "W_constraint": null, "bias": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 24, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "inbound_nodes": [[["prelu_4", 0, 0]]]}, {"name": "prelu_5", "class_name": "PReLU", "config": {"name": "prelu_5", "trainable": true, "init": "zero"}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_6", "trainable": true, "border_mode": "same", "init": "glorot_uniform", "W_constraint": null, "bias": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 36, "nb_row": 5, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "inbound_nodes": [[["prelu_5", 0, 0]]]}, {"name": "prelu_6", "class_name": "PReLU", "config": {"name": "prelu_6", "trainable": true, "init": "zero"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_7", "trainable": true, "border_mode": "same", "init": "glorot_uniform", "W_constraint": null, "bias": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 48, "nb_row": 3, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "inbound_nodes": [[["prelu_6", 0, 0]]]}, {"name": "prelu_7", "class_name": "PReLU", "config": {"name": "prelu_7", "trainable": true, "init": "zero"}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "convolution2d_8", "class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_8", "trainable": true, "border_mode": "same", "init": "glorot_uniform", "W_constraint": null, "bias": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 64, "nb_row": 3, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "inbound_nodes": [[["prelu_7", 0, 0]]]}, {"name": "prelu_8", "class_name": "PReLU", "config": {"name": "prelu_8", "trainable": true, "init": "zero"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "inbound_nodes": [[["prelu_8", 0, 0]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 100, "input_dim": 15360, "activity_regularizer": null, "bias": true, "W_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 50, "input_dim": 100, "activity_regularizer": null, "bias": true, "W_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"b_constraint": null, "name": "dense_3", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 10, "input_dim": 50, "activity_regularizer": null, "bias": true, "W_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"name": "steering_output", "class_name": "Dense", "config": {"b_constraint": null, "name": "steering_output", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "sigmoid", "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "bias": true, "W_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0]]]}, {"name": "throttle_output", "class_name": "Dense", "config": {"b_constraint": null, "name": "throttle_output", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "bias": true, "W_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0]]]}, {"name": "brake_output", "class_name": "Dense", "config": {"b_constraint": null, "name": "brake_output", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "bias": true, "W_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0]]]}, {"name": "speed_output", "class_name": "Dense", "config": {"b_constraint": null, "name": "speed_output", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "bias": true, "W_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0]]]}]}, "class_name": "Model"}