{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.2", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "images", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 80, 80, 3], "name": "images"}}, {"class_name": "Lambda", "inbound_nodes": [[["images", 0, 0, {}]]], "name": "lambda_1", "config": {"trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape": null, "function_type": "lambda", "output_shape_type": "raw"}}, {"class_name": "Conv2D", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_1", "filters": 32, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "elu_1", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_2", "filters": 32, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "elu_2", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"padding": "same", "trainable": true, "data_format": "channels_last", "name": "average_pooling2d_1", "pool_size": [4, 4], "strides": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_3", "filters": 32, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "elu_3", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "name": "dropout_1", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_4", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_4", "filters": 32, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5]}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "elu_4", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_5", "filters": 32, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "elu_5", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "name": "dropout_2", "config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_6", "filters": 32, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5]}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "elu_6", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_6", 0, 0, {}]]], "name": "conv2d_7", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_7", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "elu_7", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_8", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "elu_8", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_8", 0, 0, {}]]], "name": "dropout_3", "config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "conv2d_9", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_9", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "elu_9", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}}, {"class_name": "ELU", "inbound_nodes": [[["elu_9", 0, 0, {}]]], "name": "elu_10", "config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_10", 0, 0, {}]]], "name": "conv2d_10", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_10", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "elu_11", "config": {"trainable": true, "alpha": 1.0, "name": "elu_11"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_11", 0, 0, {}]]], "name": "dropout_4", "config": {"trainable": true, "rate": 0.5, "name": "dropout_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "conv2d_11", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_11", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "elu_12", "config": {"trainable": true, "alpha": 1.0, "name": "elu_12"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_12", 0, 0, {}]]], "name": "conv2d_12", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_12", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "elu_13", "config": {"trainable": true, "alpha": 1.0, "name": "elu_13"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_13", 0, 0, {}]]], "name": "dropout_5", "config": {"trainable": true, "rate": 0.5, "name": "dropout_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "conv2d_13", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_13", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "elu_14", "config": {"trainable": true, "alpha": 1.0, "name": "elu_14"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_14", 0, 0, {}]]], "name": "conv2d_14", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_14", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "elu_15", "config": {"trainable": true, "alpha": 1.0, "name": "elu_15"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_15", 0, 0, {}]]], "name": "dropout_6", "config": {"trainable": true, "rate": 0.5, "name": "dropout_6"}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "conv2d_15", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_15", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_15", 0, 0, {}], ["elu_14", 0, 0, {}]]], "name": "add_6", "config": {"trainable": true, "name": "add_6"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "elu_16", "config": {"trainable": true, "alpha": 1.0, "name": "elu_16"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_16", 0, 0, {}]]], "name": "conv2d_16", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_16", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "elu_17", "config": {"trainable": true, "alpha": 1.0, "name": "elu_17"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_17", 0, 0, {}]]], "name": "dropout_7", "config": {"trainable": true, "rate": 0.5, "name": "dropout_7"}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "conv2d_17", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_17", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["elu_16", 0, 0, {}]]], "name": "add_7", "config": {"trainable": true, "name": "add_7"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "elu_18", "config": {"trainable": true, "alpha": 1.0, "name": "elu_18"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_18", 0, 0, {}]]], "name": "conv2d_18", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_18", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "elu_19", "config": {"trainable": true, "alpha": 1.0, "name": "elu_19"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_19", 0, 0, {}]]], "name": "dropout_8", "config": {"trainable": true, "rate": 0.5, "name": "dropout_8"}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "conv2d_19", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_19", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["elu_18", 0, 0, {}]]], "name": "add_8", "config": {"trainable": true, "name": "add_8"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "elu_20", "config": {"trainable": true, "alpha": 1.0, "name": "elu_20"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_20", 0, 0, {}]]], "name": "conv2d_20", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_20", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "elu_21", "config": {"trainable": true, "alpha": 1.0, "name": "elu_21"}}, {"class_name": "Dropout", "inbound_nodes": [[["elu_21", 0, 0, {}]]], "name": "dropout_9", "config": {"trainable": true, "rate": 0.5, "name": "dropout_9"}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "conv2d_21", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_21", "filters": 64, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["elu_20", 0, 0, {}]]], "name": "add_9", "config": {"trainable": true, "name": "add_9"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "elu_22", "config": {"trainable": true, "alpha": 1.0, "name": "elu_22"}}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_22", 0, 0, {}]]], "name": "conv2d_22", "config": {"padding": "same", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_22", "filters": 256, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true}}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "elu_23", "config": {"trainable": true, "alpha": 1.0, "name": "elu_23"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["elu_23", 0, 0, {}]]], "name": "average_pooling2d_2", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "average_pooling2d_2", "pool_size": [4, 4], "strides": [2, 2]}}, {"class_name": "Flatten", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"activity_regularizer": null, "use_bias": true, "units": 1164, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}}}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "config": {"activity_regularizer": null, "use_bias": true, "units": 512, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}}}, {"class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3", "config": {"activity_regularizer": null, "use_bias": true, "units": 100, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_3", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}}}, {"class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dense_4", "config": {"activity_regularizer": null, "use_bias": true, "units": 50, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_4", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "seed": null, "scale": 1.0}}}}, {"class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5", "config": {"activity_regularizer": null, "use_bias": true, "units": 1, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_5", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}}}, {"class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "steering_output", "config": {"activity_regularizer": null, "use_bias": true, "units": 1, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "steering_output", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}}}], "output_layers": [["steering_output", 0, 0]], "input_layers": [["images", 0, 0]]}}