{"keras_version": "1.2.1", "config": {"output_layers": [["steering_output", 0, 0]], "input_layers": [["images", 0, 0]], "name": "model_1", "layers": [{"config": {"sparse": false, "input_dtype": "float32", "name": "images", "batch_input_shape": [null, 3, 160, 320]}, "name": "images", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "mode": 0, "name": "batchnormalization_1"}, "name": "batchnormalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["images", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 7, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "conv1", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [2, 2], "nb_filter": 96, "nb_row": 7, "bias": true, "W_constraint": null}, "name": "conv1", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "same", "dim_ordering": "tf", "trainable": true, "name": "maxpool1", "pool_size": [3, 3]}, "name": "maxpool1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv1", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire2_squeeze", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 16, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire2_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["maxpool1", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire2_expand1", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire2_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire2_squeeze", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire2_expand2", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "bias": true, "W_constraint": null}, "name": "fire2_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire2_squeeze", 0, 0]]]}, {"config": {"mode_type": "raw", "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "name": "merge_1", "concat_axis": 1, "output_mask_type": "raw"}, "name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["fire2_expand1", 0, 0], ["fire2_expand2", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire3_squeeze", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 16, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire3_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire3_expand1", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire3_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire3_squeeze", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire3_expand2", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "bias": true, "W_constraint": null}, "name": "fire3_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire3_squeeze", 0, 0]]]}, {"config": {"mode_type": "raw", "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "name": "merge_2", "concat_axis": 1, "output_mask_type": "raw"}, "name": "merge_2", "class_name": "Merge", "inbound_nodes": [[["fire3_expand1", 0, 0], ["fire3_expand2", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire4_squeeze", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 32, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire4_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire4_expand1", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 128, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire4_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire4_squeeze", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire4_expand2", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 128, "nb_row": 3, "bias": true, "W_constraint": null}, "name": "fire4_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire4_squeeze", 0, 0]]]}, {"config": {"mode_type": "raw", "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "name": "merge_3", "concat_axis": 1, "output_mask_type": "raw"}, "name": "merge_3", "class_name": "Merge", "inbound_nodes": [[["fire4_expand1", 0, 0], ["fire4_expand2", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "name": "maxpool4", "pool_size": [3, 3]}, "name": "maxpool4", "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_3", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire5_squeeze", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 32, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire5_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["maxpool4", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire5_expand1", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 128, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire5_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire5_squeeze", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire5_expand2", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 128, "nb_row": 3, "bias": true, "W_constraint": null}, "name": "fire5_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire5_squeeze", 0, 0]]]}, {"config": {"mode_type": "raw", "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "name": "merge_4", "concat_axis": 1, "output_mask_type": "raw"}, "name": "merge_4", "class_name": "Merge", "inbound_nodes": [[["fire5_expand1", 0, 0], ["fire5_expand2", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire6_squeeze", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 48, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire6_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_4", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire6_expand1", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 192, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire6_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire6_squeeze", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire6_expand2", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 192, "nb_row": 3, "bias": true, "W_constraint": null}, "name": "fire6_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire6_squeeze", 0, 0]]]}, {"config": {"mode_type": "raw", "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "name": "merge_5", "concat_axis": 1, "output_mask_type": "raw"}, "name": "merge_5", "class_name": "Merge", "inbound_nodes": [[["fire6_expand1", 0, 0], ["fire6_expand2", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire7_squeeze", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 48, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire7_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_5", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire7_expand1", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 192, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire7_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire7_squeeze", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire7_expand2", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 192, "nb_row": 3, "bias": true, "W_constraint": null}, "name": "fire7_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire7_squeeze", 0, 0]]]}, {"config": {"mode_type": "raw", "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "name": "merge_6", "concat_axis": 1, "output_mask_type": "raw"}, "name": "merge_6", "class_name": "Merge", "inbound_nodes": [[["fire7_expand1", 0, 0], ["fire7_expand2", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire8_squeeze", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire8_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["merge_6", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire8_expand1", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 256, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire8_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire8_squeeze", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire8_expand2", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 256, "nb_row": 3, "bias": true, "W_constraint": null}, "name": "fire8_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire8_squeeze", 0, 0]]]}, {"config": {"mode_type": "raw", "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "name": "merge_7", "concat_axis": 1, "output_mask_type": "raw"}, "name": "merge_7", "class_name": "Merge", "inbound_nodes": [[["fire8_expand1", 0, 0], ["fire8_expand2", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "name": "maxpool8", "pool_size": [3, 3]}, "name": "maxpool8", "class_name": "MaxPooling2D", "inbound_nodes": [[["merge_7", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire9_squeeze", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire9_squeeze", "class_name": "Convolution2D", "inbound_nodes": [[["maxpool8", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire9_expand1", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 256, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "fire9_expand1", "class_name": "Convolution2D", "inbound_nodes": [[["fire9_squeeze", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "same", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "name": "fire9_expand2", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 256, "nb_row": 3, "bias": true, "W_constraint": null}, "name": "fire9_expand2", "class_name": "Convolution2D", "inbound_nodes": [[["fire9_squeeze", 0, 0]]]}, {"config": {"mode_type": "raw", "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "name": "merge_8", "concat_axis": 1, "output_mask_type": "raw"}, "name": "merge_8", "class_name": "Merge", "inbound_nodes": [[["fire9_expand1", 0, 0], ["fire9_expand2", 0, 0]]]}, {"config": {"trainable": true, "name": "fire9_dropout", "p": 0.5}, "name": "fire9_dropout", "class_name": "Dropout", "inbound_nodes": [[["merge_8", 0, 0]]]}, {"config": {"activity_regularizer": null, "border_mode": "valid", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "name": "conv10", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 10, "nb_row": 1, "bias": true, "W_constraint": null}, "name": "conv10", "class_name": "Convolution2D", "inbound_nodes": [[["fire9_dropout", 0, 0]]]}, {"config": {"strides": [13, 13], "border_mode": "same", "dim_ordering": "tf", "trainable": true, "name": "avgpool10", "pool_size": [13, 13]}, "name": "avgpool10", "class_name": "AveragePooling2D", "inbound_nodes": [[["conv10", 0, 0]]]}, {"config": {"trainable": true, "name": "flatten"}, "name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["avgpool10", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "output_dim": 1, "input_dim": 40, "init": "glorot_uniform", "name": "steering_output", "bias": true, "W_constraint": null}, "name": "steering_output", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0]]]}]}, "class_name": "Model"}