{"config": {"input_layers": [["center_img", 0, 0]], "name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 3, 160, 320], "name": "center_img", "input_dtype": "float32", "sparse": false}, "name": "center_img", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_1", "axis": -1, "beta_regularizer": null, "momentum": 0.99}, "name": "batchnormalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["center_img", 0, 0]]]}, {"config": {"nb_row": 5, "subsample": [1, 1], "W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_1", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "trainable": true, "nb_filter": 32, "b_constraint": null, "activation": "linear"}, "name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"config": {"trainable": true, "name": "prelu_1", "init": "zero"}, "name": "prelu_1", "class_name": "PReLU", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["prelu_1", 0, 0]]]}, {"config": {"nb_row": 5, "subsample": [1, 1], "W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_2", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "trainable": true, "nb_filter": 3, "b_constraint": null, "activation": "linear"}, "name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"trainable": true, "name": "prelu_2", "init": "zero"}, "name": "prelu_2", "class_name": "PReLU", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"config": {"nb_row": 5, "subsample": [1, 1], "W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_3", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "trainable": true, "nb_filter": 24, "b_constraint": null, "activation": "linear"}, "name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["prelu_2", 0, 0]]]}, {"config": {"trainable": true, "name": "prelu_3", "init": "zero"}, "name": "prelu_3", "class_name": "PReLU", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"config": {"nb_row": 5, "subsample": [1, 1], "W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_4", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "trainable": true, "nb_filter": 36, "b_constraint": null, "activation": "linear"}, "name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["prelu_3", 0, 0]]]}, {"config": {"trainable": true, "name": "prelu_4", "init": "zero"}, "name": "prelu_4", "class_name": "PReLU", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"config": {"nb_row": 3, "subsample": [1, 1], "W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_5", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "trainable": true, "nb_filter": 48, "b_constraint": null, "activation": "linear"}, "name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["prelu_4", 0, 0]]]}, {"config": {"trainable": true, "name": "prelu_5", "init": "zero"}, "name": "prelu_5", "class_name": "PReLU", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"config": {"nb_row": 3, "subsample": [1, 1], "W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_6", "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "trainable": true, "nb_filter": 64, "b_constraint": null, "activation": "linear"}, "name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["prelu_5", 0, 0]]]}, {"config": {"trainable": true, "name": "prelu_6", "init": "zero"}, "name": "prelu_6", "class_name": "PReLU", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["prelu_6", 0, 0]]]}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"config": {"input_dim": 30720, "output_dim": 100, "W_constraint": null, "bias": true, "name": "dense_1", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"config": {"input_dim": 100, "output_dim": 50, "W_constraint": null, "bias": true, "name": "dense_2", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"config": {"input_dim": 50, "output_dim": 10, "W_constraint": null, "bias": true, "name": "dense_3", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"config": {"input_dim": 10, "output_dim": 1, "W_constraint": null, "bias": true, "name": "steering_output", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "relu"}, "name": "steering_output", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"config": {"input_dim": 10, "output_dim": 1, "W_constraint": null, "bias": true, "name": "throttle_output", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "name": "throttle_output", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"config": {"input_dim": 10, "output_dim": 1, "W_constraint": null, "bias": true, "name": "speed_output", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "name": "speed_output", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0]]]}], "output_layers": [["steering_output", 0, 0], ["throttle_output", 0, 0], ["speed_output", 0, 0]]}, "keras_version": "1.2.1", "class_name": "Model"}