{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "images", "inbound_nodes": [], "config": {"dtype": "float32", "name": "images", "sparse": false, "batch_input_shape": [null, 80, 80, 3]}}, {"class_name": "Lambda", "name": "lambda_1", "inbound_nodes": [[["images", 0, 0, {}]]], "config": {"trainable": true, "output_shape": null, "arguments": {}, "function_type": "lambda", "name": "lambda_1", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00c0\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "strides": [2, 2], "padding": "same", "kernel_constraint": null, "trainable": true, "filters": 32, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_1", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "name": "elu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "strides": [2, 2], "padding": "same", "kernel_constraint": null, "trainable": true, "filters": 24, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_2", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "name": "elu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "trainable": true, "filters": 36, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_3", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "name": "elu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "trainable": true, "filters": 24, "kernel_size": [5, 5], "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_4", "activation": "linear"}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["elu_2", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_4", "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "name": "elu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_constraint": null, "trainable": true, "filters": 64, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_5", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_5", "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ELU", "name": "elu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_1", "pool_size": [4, 4], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "units": 1164, "activation": "elu", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "units": 512, "activation": "linear", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "units": 100, "activation": "linear", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "units": 50, "activation": "linear", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "activation": "tanh", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "name": "steering_output", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "activation": "linear", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "steering_output", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}], "input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]]}, "keras_version": "2.0.2", "backend": "tensorflow"}