{"config": {"name": "model_1", "output_layers": [["steering_output", 0, 0]], "input_layers": [["images", 0, 0]], "layers": [{"name": "images", "class_name": "InputLayer", "config": {"name": "images", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 80, 80, 3]}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0001\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape": null}, "inbound_nodes": [[["images", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_1", "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_1", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "elu_1", "class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_2", "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_2", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "elu_2", "class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"padding": "same", "name": "average_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [4, 4]}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_3", "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_3", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "elu_3", "class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_4", "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_4", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "elu_4", "class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_5", "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_5", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "elu_5", "class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_6", "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_6", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "elu_6", "class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_7", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_7", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "elu_7", "class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_8", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_8", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "elu_8", "class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_9", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_9", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "elu_9", "class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "elu_10", "class_name": "ELU", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_10", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_10", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "elu_11", "class_name": "ELU", "config": {"name": "elu_11", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_11", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_11", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "elu_12", "class_name": "ELU", "config": {"name": "elu_12", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_12", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_12", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "elu_13", "class_name": "ELU", "config": {"name": "elu_13", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_13", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_13", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_13", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "elu_14", "class_name": "ELU", "config": {"name": "elu_14", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_14", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_14", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_14", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "elu_15", "class_name": "ELU", "config": {"name": "elu_15", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_15", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_15", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}], ["elu_14", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_15", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "elu_16", "class_name": "ELU", "config": {"name": "elu_16", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_16", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_16", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_16", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "elu_17", "class_name": "ELU", "config": {"name": "elu_17", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_17", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_17", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["elu_16", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_17", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "elu_18", "class_name": "ELU", "config": {"name": "elu_18", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_18", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_18", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_18", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "elu_19", "class_name": "ELU", "config": {"name": "elu_19", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_19", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_19", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["elu_18", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_19", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "elu_20", "class_name": "ELU", "config": {"name": "elu_20", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_20", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_20", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_20", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "elu_21", "class_name": "ELU", "config": {"name": "elu_21", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_21", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_21", "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["elu_20", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_21", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "elu_22", "class_name": "ELU", "config": {"name": "elu_22", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"activation": "linear", "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_22", "dilation_rate": [1, 1], "filters": 256, "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["elu_22", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "name": "batch_normalization_22", "momentum": 0.99, "beta_constraint": null, "axis": -1}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "elu_23", "class_name": "ELU", "config": {"name": "elu_23", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"padding": "valid", "name": "average_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [4, 4]}, "inbound_nodes": [[["elu_23", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"activation": "elu", "units": 1164, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"activation": "linear", "units": 512, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"activation": "linear", "units": 100, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"activation": "linear", "units": 50, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": {"config": {"max_value": 2.0, "axis": 0}, "class_name": "MaxNorm"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_4", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"activation": "linear", "units": 1, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_5", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "steering_output", "class_name": "Dense", "config": {"activation": "linear", "units": 1, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "steering_output", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.2"}