{"backend": "theano", "keras_version": "2.0.2", "config": {"output_layers": [["steering_output", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 3, 66, 200], "name": "images", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "name": "images", "class_name": "InputLayer"}, {"config": {"arguments": {}, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0090\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "inbound_nodes": [[["images", 0, 0, {}]]], "name": "lambda_1", "class_name": "Lambda"}, {"config": {"padding": "valid", "data_format": "channels_first", "activation": "linear", "kernel_size": [5, 5], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "conv2d_1", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "filters": 3}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "elu_1", "class_name": "ELU"}, {"config": {"padding": "valid", "data_format": "channels_first", "activation": "linear", "kernel_size": [5, 5], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "conv2d_2", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "filters": 24}, "inbound_nodes": [[["elu_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "elu_2", "class_name": "ELU"}, {"config": {"padding": "valid", "data_format": "channels_first", "activation": "linear", "kernel_size": [5, 5], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "conv2d_3", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "filters": 36}, "inbound_nodes": [[["elu_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "elu_3", "class_name": "ELU"}, {"config": {"padding": "valid", "data_format": "channels_first", "activation": "linear", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "conv2d_4", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "filters": 48}, "inbound_nodes": [[["elu_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "elu_4", "class_name": "ELU"}, {"config": {"padding": "valid", "data_format": "channels_first", "activation": "linear", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "conv2d_5", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "filters": 64}, "inbound_nodes": [[["elu_4", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "elu_5", "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"units": 1164, "bias_constraint": null, "activation": "elu", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"units": 512, "bias_constraint": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "dense_2", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"units": 100, "bias_constraint": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "dense_3", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout"}, {"config": {"units": 50, "bias_constraint": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "name": "dense_4", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout"}, {"config": {"units": 1, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "name": "dense_5", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense"}, {"config": {"units": 1, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "name": "steering_output", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "steering_output", "class_name": "Dense"}], "name": "model_1", "input_layers": [["images", 0, 0]]}, "class_name": "Model"}