{"class_name": "Model", "keras_version": "2.0.2", "config": {"name": "model_1", "layers": [{"name": "images", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "images", "sparse": false, "batch_input_shape": [null, 80, 80, 3]}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00bf\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["images", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}}, "strides": [2, 2], "name": "conv2d_1", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"trainable": true, "beta_constraint": null, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "elu_1", "class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}}, "strides": [2, 2], "name": "conv2d_2", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "filters": 24, "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_constraint": null}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"trainable": true, "beta_constraint": null, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "elu_2", "class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}}, "strides": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "filters": 36, "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_constraint": null}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"trainable": true, "beta_constraint": null, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "elu_3", "class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}}, "strides": [1, 1], "name": "conv2d_4", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "filters": 24, "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["elu_2", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"trainable": true, "beta_constraint": null, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "elu_4", "class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}}, "strides": [1, 1], "name": "conv2d_5", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_constraint": null}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"trainable": true, "beta_constraint": null, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "elu_5", "class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [5, 5], "name": "average_pooling2d_1", "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}}, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "units": 1164, "activation": "elu", "bias_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}}, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "units": 512, "activation": "linear", "bias_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.2, "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}}, "bias_constraint": null, "name": "dense_3", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "units": 100, "activation": "linear", "bias_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_avg"}}, "bias_constraint": null, "name": "dense_4", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "units": 50, "activation": "linear", "bias_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "name": "dense_5", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "activation": "tanh", "bias_regularizer": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "steering_output", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "name": "steering_output", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "activation": "linear", "bias_regularizer": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]]}, "backend": "tensorflow"}