{"keras_version": "2.0.2", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["images", 0, 0]], "layers": [{"name": "images", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "images", "batch_input_shape": [null, 3, 66, 200]}}, {"name": "lambda_1", "inbound_nodes": [[["images", 0, 0, {}]]], "class_name": "Lambda", "config": {"trainable": true, "output_shape": null, "name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0084\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "arguments": {}}}, {"name": "conv2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_first", "kernel_constraint": null, "name": "conv2d_1", "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "kernel_size": [5, 5], "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 3, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"name": "elu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"name": "conv2d_2", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_first", "kernel_constraint": null, "name": "conv2d_2", "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "kernel_size": [5, 5], "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 24, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"name": "elu_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"name": "conv2d_3", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_first", "kernel_constraint": null, "name": "conv2d_3", "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "kernel_size": [5, 5], "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 36, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"name": "elu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"name": "conv2d_4", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_first", "kernel_constraint": null, "name": "conv2d_4", "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 48, "activation": "linear", "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"name": "elu_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"name": "conv2d_5", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_first", "kernel_constraint": null, "name": "conv2d_5", "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "activation": "linear", "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"name": "elu_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"name": "flatten_1", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "activation": "linear", "use_bias": true, "bias_constraint": null}}, {"name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "activation": "linear", "use_bias": true, "bias_constraint": null}}, {"name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "activation": "linear", "use_bias": true, "bias_constraint": null}}, {"name": "dropout_3", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}}, {"name": "dense_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null}}, {"name": "steering_output", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "name": "steering_output", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null}}], "output_layers": [["steering_output", 0, 0]]}, "backend": "theano"}