{"config": {"name": "model_1", "input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]], "layers": [{"name": "images", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 80, 80, 3], "name": "images"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "lambda_1", "config": {"name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00bf\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw", "trainable": true, "arguments": {}}, "inbound_nodes": [[["images", 0, 0, {}]]], "class_name": "Lambda"}, {"name": "conv2d_1", "config": {"activity_regularizer": null, "strides": [2, 2], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "activation": "linear", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_1", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "name": "batch_normalization_1", "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_1", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_2", "config": {"activity_regularizer": null, "strides": [2, 2], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "activation": "linear", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "filters": 24, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_2", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["elu_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_2", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "name": "batch_normalization_2", "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_2", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_3", "config": {"activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "activation": "linear", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "filters": 36, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_3", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["elu_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_3", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "name": "batch_normalization_3", "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_3", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "ELU"}, {"name": "dropout_1", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["elu_3", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_4", "config": {"activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "activation": "linear", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "filters": 24, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_4", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["elu_2", 0, 0, {}]]], "class_name": "Add"}, {"name": "batch_normalization_4", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "name": "batch_normalization_4", "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_4", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "ELU"}, {"name": "conv2d_5", "config": {"activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "activation": "linear", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_5", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["elu_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_5", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "name": "batch_normalization_5", "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "elu_5", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "ELU"}, {"name": "average_pooling2d_1", "config": {"name": "average_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [5, 5], "padding": "valid", "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0, {}]]], "class_name": "AveragePooling2D"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"activity_regularizer": null, "name": "dense_1", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "bias_constraint": null, "bias_regularizer": null, "units": 1164, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_2", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"activity_regularizer": null, "name": "dense_2", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "units": 512, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_3", "config": {"name": "dropout_3", "rate": 0.2, "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_3", "config": {"activity_regularizer": null, "name": "dense_3", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "units": 100, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_4", "config": {"activity_regularizer": null, "name": "dense_4", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "units": 50, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "normal"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_5", "config": {"activity_regularizer": null, "name": "dense_5", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "units": 1, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense"}, {"name": "steering_output", "config": {"activity_regularizer": null, "name": "steering_output", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "units": 1, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.2"}