{"class_name": "Model", "keras_version": "2.0.2", "backend": "tensorflow", "config": {"input_layers": [["images", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 80, 3], "dtype": "float32", "sparse": false, "name": "images"}, "name": "images", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u000e\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}, "output_shape": null, "name": "lambda_1"}, "name": "lambda_1", "inbound_nodes": [[["images", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [2, 2]}, "name": "conv2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "name": "elu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [2, 2]}, "name": "conv2d_2", "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "name": "elu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_1", "padding": "same", "data_format": "channels_last", "pool_size": [4, 4], "strides": [2, 2]}, "name": "average_pooling2d_1", "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_3", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_3", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "name": "elu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "name": "dropout_1", "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_4", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_4", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_4", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "name": "elu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_5", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_5", "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "name": "elu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "name": "dropout_2", "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_6", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_6", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_6", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "name": "elu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_7", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_7", "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "name": "elu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_8", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_8", "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "name": "elu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "name": "dropout_3", "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_9", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_9", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_9", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}, "name": "elu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_10"}, "name": "elu_10", "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_10", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_10", "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_11"}, "name": "elu_11", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.5}, "name": "dropout_4", "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_11", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_11", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_11", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_12"}, "name": "elu_12", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_12", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_12", "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_13"}, "name": "elu_13", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.5}, "name": "dropout_5", "inbound_nodes": [[["elu_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_13", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_13", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_13", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_14"}, "name": "elu_14", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_14", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_14", "inbound_nodes": [[["elu_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_15"}, "name": "elu_15", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.5}, "name": "dropout_6", "inbound_nodes": [[["elu_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_15", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_15", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["conv2d_15", 0, 0, {}], ["elu_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_15", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_16"}, "name": "elu_16", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_16", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_16", "inbound_nodes": [[["elu_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_17"}, "name": "elu_17", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "rate": 0.5}, "name": "dropout_7", "inbound_nodes": [[["elu_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_17", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_17", "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7", "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["elu_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_17", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_18"}, "name": "elu_18", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_constraint": null, "use_bias": true, "filters": 256, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_18", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1]}, "name": "conv2d_18", "inbound_nodes": [[["elu_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_19"}, "name": "elu_19", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [4, 4], "strides": [2, 2]}, "name": "average_pooling2d_2", "inbound_nodes": [[["elu_19", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "units": 1164}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "units": 512}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "units": 100}, "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "normal", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "name": "dense_4", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "units": 50}, "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_5", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "units": 1}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "steering_output", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "units": 1}, "name": "steering_output", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["steering_output", 0, 0]]}}