{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "images", "batch_input_shape": [null, 3, 90, 320], "input_dtype": "float32"}, "name": "images"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["images", 0, 0]]], "config": {"name": "batchnormalization_1", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "epsilon": 0.001, "axis": -1, "trainable": true, "momentum": 0.99}, "name": "batchnormalization_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"border_mode": "same", "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_constraint": null, "trainable": true, "name": "convolution2d_1", "init": "glorot_uniform", "nb_filter": 3, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_col": 5}, "name": "convolution2d_1"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "name": "elu_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_1", 0, 0]]], "config": {"border_mode": "same", "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_constraint": null, "trainable": true, "name": "convolution2d_2", "init": "glorot_uniform", "nb_filter": 24, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_col": 5}, "name": "convolution2d_2"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "name": "elu_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_2", 0, 0]]], "config": {"border_mode": "same", "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_constraint": null, "trainable": true, "name": "convolution2d_3", "init": "glorot_uniform", "nb_filter": 36, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_col": 5}, "name": "convolution2d_3"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "name": "elu_3"}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_3", 0, 0]]], "config": {"border_mode": "same", "b_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_constraint": null, "trainable": true, "name": "convolution2d_4", "init": "glorot_uniform", "nb_filter": 48, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_col": 3}, "name": "convolution2d_4"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "name": "elu_4"}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_4", 0, 0]]], "config": {"border_mode": "same", "b_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_constraint": null, "trainable": true, "name": "convolution2d_5", "init": "glorot_uniform", "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_col": 3}, "name": "convolution2d_5"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "name": "elu_5"}, {"class_name": "Dropout", "inbound_nodes": [[["elu_5", 0, 0]]], "config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "name": "dropout_1"}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"b_regularizer": null, "input_dim": 17280, "output_dim": 512, "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true}, "name": "dense_1"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"name": "dropout_2", "trainable": true, "p": 0.25}, "name": "dropout_2"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"b_regularizer": null, "input_dim": 512, "output_dim": 100, "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true}, "name": "dense_2"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"name": "dropout_3", "trainable": true, "p": 0.25}, "name": "dropout_3"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"b_regularizer": null, "input_dim": 100, "output_dim": 50, "b_constraint": null, "activity_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true}, "name": "dense_3"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0]]], "config": {"name": "dropout_4", "trainable": true, "p": 0.25}, "name": "dropout_4"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0]]], "config": {"b_regularizer": null, "input_dim": 50, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true}, "name": "dense_4"}, {"class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0]]], "config": {"b_regularizer": null, "input_dim": 1, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "name": "steering_output", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true}, "name": "steering_output"}], "output_layers": [["steering_output", 0, 0]], "input_layers": [["images", 0, 0]]}, "keras_version": "1.2.1"}