{"class_name": "Model", "keras_version": "2.0.2", "config": {"name": "model_1", "layers": [{"name": "images", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "images", "sparse": false, "batch_input_shape": [null, 80, 80, 3]}}, {"name": "lambda_1", "inbound_nodes": [[["images", 0, 0, {}]]], "class_name": "Lambda", "config": {"name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0001\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "trainable": true}}, {"name": "conv2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 32, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [2, 2], "trainable": true}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_2", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 32, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [2, 2], "trainable": true}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [4, 4], "strides": [2, 2], "padding": "same"}}, {"name": "conv2d_3", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 32, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"name": "dropout_1", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"name": "conv2d_4", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 32, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "add_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "batch_normalization_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_5", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 32, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"name": "dropout_2", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"name": "conv2d_6", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 32, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "add_2", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"name": "batch_normalization_6", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_7", "inbound_nodes": [[["elu_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_7", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_8", "inbound_nodes": [[["elu_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_8", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"name": "dropout_3", "inbound_nodes": [[["elu_8", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "trainable": true}}, {"name": "conv2d_9", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_9", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "add_3", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"name": "batch_normalization_9", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"name": "elu_10", "inbound_nodes": [[["elu_9", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_10", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_10", "inbound_nodes": [[["elu_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_10", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_11", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_11", "alpha": 1.0, "trainable": true}}, {"name": "dropout_4", "inbound_nodes": [[["elu_11", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.5, "trainable": true}}, {"name": "conv2d_11", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_11", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "add_4", "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"name": "batch_normalization_11", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_12", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_12", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_12", "inbound_nodes": [[["elu_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_12", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_13", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_13", "alpha": 1.0, "trainable": true}}, {"name": "dropout_5", "inbound_nodes": [[["elu_13", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.5, "trainable": true}}, {"name": "conv2d_13", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_13", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "add_5", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_5", "trainable": true}}, {"name": "batch_normalization_13", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_14", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_14", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_14", "inbound_nodes": [[["elu_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_14", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_15", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_15", "alpha": 1.0, "trainable": true}}, {"name": "dropout_6", "inbound_nodes": [[["elu_15", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.5, "trainable": true}}, {"name": "conv2d_15", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_15", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "add_6", "inbound_nodes": [[["conv2d_15", 0, 0, {}], ["elu_14", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_6", "trainable": true}}, {"name": "batch_normalization_15", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_16", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_16", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_16", "inbound_nodes": [[["elu_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_16", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_17", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_17", "alpha": 1.0, "trainable": true}}, {"name": "dropout_7", "inbound_nodes": [[["elu_17", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_7", "rate": 0.5, "trainable": true}}, {"name": "conv2d_17", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_17", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "add_7", "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["elu_16", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_7", "trainable": true}}, {"name": "batch_normalization_17", "inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_18", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_18", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_18", "inbound_nodes": [[["elu_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_18", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_19", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_19", "alpha": 1.0, "trainable": true}}, {"name": "dropout_8", "inbound_nodes": [[["elu_19", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_8", "rate": 0.5, "trainable": true}}, {"name": "conv2d_19", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_19", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "add_8", "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["elu_18", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_8", "trainable": true}}, {"name": "batch_normalization_19", "inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_20", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_20", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_20", "inbound_nodes": [[["elu_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_20", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_21", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_21", "alpha": 1.0, "trainable": true}}, {"name": "dropout_9", "inbound_nodes": [[["elu_21", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_9", "rate": 0.5, "trainable": true}}, {"name": "conv2d_21", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_21", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 64, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "add_9", "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["elu_20", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_9", "trainable": true}}, {"name": "batch_normalization_21", "inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_22", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_22", "alpha": 1.0, "trainable": true}}, {"name": "conv2d_22", "inbound_nodes": [[["elu_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_22", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "padding": "same", "filters": 256, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "trainable": true}}, {"name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true}}, {"name": "elu_23", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_23", "alpha": 1.0, "trainable": true}}, {"name": "average_pooling2d_2", "inbound_nodes": [[["elu_23", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [4, 4], "strides": [2, 2], "padding": "valid"}}, {"name": "flatten_1", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "units": 1164, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu"}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "units": 512, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_3", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "units": 100, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_4", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_avg", "scale": 1.0}}, "units": 50, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 2.0, "axis": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_5", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "units": 1, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"name": "steering_output", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "steering_output", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "units": 1, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}], "input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]]}, "backend": "tensorflow"}