{"config": {"output_layers": [["steering_output", 0, 0]], "name": "model_1", "input_layers": [["images", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "images", "config": {"batch_input_shape": [null, 80, 80, 3], "name": "images", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Lambda", "name": "lambda_1", "config": {"output_shape": null, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>+\u0001\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["images", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_1", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_1", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_2", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"trainable": true, "pool_size": [4, 4], "padding": "same", "strides": [2, 2], "name": "average_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_3", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_4", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_4", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_5", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_5", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_6", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["elu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_6", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_7", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_7", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_8", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_8", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_9", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["elu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_9", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_10", "config": {"trainable": true, "name": "elu_10", "alpha": 1.0}, "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_10", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_11", "config": {"trainable": true, "name": "elu_11", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "rate": 0.5}, "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_11", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["elu_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_12", "config": {"trainable": true, "name": "elu_12", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_12", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_13", "config": {"trainable": true, "name": "elu_13", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "rate": 0.5}, "inbound_nodes": [[["elu_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_13", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["elu_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_14", "config": {"trainable": true, "name": "elu_14", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_14", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["elu_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_15", "config": {"trainable": true, "name": "elu_15", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"trainable": true, "name": "dropout_6", "rate": 0.5}, "inbound_nodes": [[["elu_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_15", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}], ["elu_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_16", "config": {"trainable": true, "name": "elu_16", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_16", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["elu_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_17", "config": {"trainable": true, "name": "elu_17", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_7", "config": {"trainable": true, "name": "dropout_7", "rate": 0.5}, "inbound_nodes": [[["elu_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_17", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["elu_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_18", "config": {"trainable": true, "name": "elu_18", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_18", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["elu_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_19", "config": {"trainable": true, "name": "elu_19", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_8", "config": {"trainable": true, "name": "dropout_8", "rate": 0.5}, "inbound_nodes": [[["elu_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_19", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["elu_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_20", "config": {"trainable": true, "name": "elu_20", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_20", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["elu_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_21", "config": {"trainable": true, "name": "elu_21", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_9", "config": {"trainable": true, "name": "dropout_9", "rate": 0.5}, "inbound_nodes": [[["elu_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_21", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["elu_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_22", "config": {"trainable": true, "name": "elu_22", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_22", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["elu_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "gamma_constraint": null, "center": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_23", "config": {"trainable": true, "name": "elu_23", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"trainable": true, "pool_size": [4, 4], "padding": "valid", "strides": [2, 2], "name": "average_pooling2d_2", "data_format": "channels_last"}, "inbound_nodes": [[["elu_23", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "elu", "name": "dense_1", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 1164, "kernel_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "name": "dense_2", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 512, "kernel_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "name": "dense_3", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 100, "kernel_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "name": "dense_4", "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 2.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 50, "kernel_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "name": "dense_5", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 1, "kernel_regularizer": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "steering_output", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "name": "steering_output", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 1, "kernel_regularizer": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.2"}