{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "images", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "images", "batch_input_shape": [null, 80, 80, 3], "dtype": "float32", "sparse": false}}, {"name": "lambda_1", "class_name": "Lambda", "inbound_nodes": [[["images", 0, 0, {}]]], "config": {"name": "lambda_1", "function_type": "lambda", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00c0\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape_type": "raw"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"kernel_size": [5, 5], "name": "conv2d_1", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "use_bias": true, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"axis": -1, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "elu_1", "class_name": "ELU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "config": {"kernel_size": [5, 5], "name": "conv2d_2", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 24, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "use_bias": true, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"axis": -1, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "elu_2", "class_name": "ELU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "config": {"kernel_size": [5, 5], "name": "conv2d_3", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 36, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "use_bias": true, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"axis": -1, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "elu_3", "class_name": "ELU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_size": [5, 5], "name": "conv2d_4", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 24, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "use_bias": true, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["elu_2", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"axis": -1, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "elu_4", "class_name": "ELU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "name": "conv2d_5", "data_format": "channels_last", "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "use_bias": true, "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"axis": -1, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "elu_5", "class_name": "ELU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "config": {"name": "average_pooling2d_1", "data_format": "channels_last", "padding": "valid", "pool_size": [4, 4], "trainable": true, "strides": [2, 2]}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"units": 1164, "trainable": true, "bias_constraint": null, "activation": "elu", "name": "dense_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"units": 512, "trainable": true, "bias_constraint": null, "activation": "linear", "name": "dense_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"units": 100, "trainable": true, "bias_constraint": null, "activation": "linear", "name": "dense_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"units": 50, "trainable": true, "bias_constraint": null, "activation": "linear", "name": "dense_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"units": 1, "trainable": true, "bias_constraint": null, "activation": "tanh", "name": "dense_5", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"name": "steering_output", "class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"units": 1, "trainable": true, "bias_constraint": null, "activation": "linear", "name": "steering_output", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}], "output_layers": [["steering_output", 0, 0]], "input_layers": [["images", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.2"}