{"config": {"layers": [{"config": {"batch_input_shape": [null, 80, 80, 3], "sparse": false, "dtype": "float32", "name": "images"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "images"}, {"config": {"trainable": true, "arguments": {}, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00bf\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw"}, "class_name": "Lambda", "inbound_nodes": [[["images", 0, 0, {}]]], "name": "lambda_1"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_1", "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 32, "trainable": true, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "elu_1"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_2", "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 24, "trainable": true, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "elu_2"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_3", "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 36, "trainable": true, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "name": "conv2d_3"}, {"config": {"beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "elu_3"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "name": "dropout_1"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_4", "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 24, "trainable": true, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_4"}, {"config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["elu_2", 0, 0, {}]]], "name": "add_1"}, {"config": {"beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_4", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "batch_normalization_4"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "elu_4"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_5", "activity_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 64, "trainable": true, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "name": "conv2d_5"}, {"config": {"beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_5", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "elu_5"}, {"config": {"trainable": true, "pool_size": [5, 5], "name": "average_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "AveragePooling2D", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "name": "average_pooling2d_1"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "flatten_1"}, {"config": {"bias_regularizer": null, "activation": "elu", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "name": "dense_1", "activity_regularizer": null, "units": 1164, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"config": {"bias_regularizer": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "name": "dense_2", "activity_regularizer": null, "units": 512, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}, {"config": {"bias_regularizer": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "name": "dense_3", "activity_regularizer": null, "units": 100, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3"}, {"config": {"bias_regularizer": null, "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "name": "dense_4", "activity_regularizer": null, "units": 50, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dense_4"}, {"config": {"bias_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "name": "dense_5", "activity_regularizer": null, "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5"}, {"config": {"bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "name": "steering_output", "activity_regularizer": null, "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "steering_output"}], "output_layers": [["steering_output", 0, 0]], "name": "model_1", "input_layers": [["images", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.2", "backend": "tensorflow"}