{"keras_version": "1.2.1", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "center_img", "config": {"batch_input_shape": [null, 3, 160, 320], "sparse": false, "name": "center_img", "input_dtype": "float32"}, "inbound_nodes": []}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "config": {"epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_1"}, "inbound_nodes": [[["center_img", 0, 0]]]}, {"class_name": "Convolution2D", "name": "conv1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 7, "subsample": [2, 2], "name": "conv1", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 96, "activation": "relu", "nb_row": 7, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpool1", "config": {"pool_size": [3, 3], "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "same", "name": "maxpool1"}, "inbound_nodes": [[["conv1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire2_squeeze", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire2_squeeze", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 16, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["maxpool1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire2_expand1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire2_expand1", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 64, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire2_squeeze", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire2_expand2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "name": "fire2_expand2", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 64, "activation": "relu", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire2_squeeze", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"output_shape": null, "output_mask": null, "name": "merge_1", "arguments": {}, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw"}, "inbound_nodes": [[["fire2_expand1", 0, 0], ["fire2_expand2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire3_squeeze", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire3_squeeze", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 16, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire3_expand1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire3_expand1", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 64, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire3_squeeze", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire3_expand2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "name": "fire3_expand2", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 64, "activation": "relu", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire3_squeeze", 0, 0]]]}, {"class_name": "Merge", "name": "merge_2", "config": {"output_shape": null, "output_mask": null, "name": "merge_2", "arguments": {}, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw"}, "inbound_nodes": [[["fire3_expand1", 0, 0], ["fire3_expand2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire4_squeeze", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire4_squeeze", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 32, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire4_expand1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire4_expand1", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 128, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire4_squeeze", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire4_expand2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "name": "fire4_expand2", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 128, "activation": "relu", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire4_squeeze", 0, 0]]]}, {"class_name": "Merge", "name": "merge_3", "config": {"output_shape": null, "output_mask": null, "name": "merge_3", "arguments": {}, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw"}, "inbound_nodes": [[["fire4_expand1", 0, 0], ["fire4_expand2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpool4", "config": {"pool_size": [3, 3], "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpool4"}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire5_squeeze", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire5_squeeze", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 32, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["maxpool4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire5_expand1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire5_expand1", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 128, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire5_squeeze", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire5_expand2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "name": "fire5_expand2", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 128, "activation": "relu", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire5_squeeze", 0, 0]]]}, {"class_name": "Merge", "name": "merge_4", "config": {"output_shape": null, "output_mask": null, "name": "merge_4", "arguments": {}, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw"}, "inbound_nodes": [[["fire5_expand1", 0, 0], ["fire5_expand2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire6_squeeze", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire6_squeeze", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 48, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire6_expand1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire6_expand1", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 192, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire6_squeeze", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire6_expand2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "name": "fire6_expand2", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 192, "activation": "relu", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire6_squeeze", 0, 0]]]}, {"class_name": "Merge", "name": "merge_5", "config": {"output_shape": null, "output_mask": null, "name": "merge_5", "arguments": {}, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw"}, "inbound_nodes": [[["fire6_expand1", 0, 0], ["fire6_expand2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire7_squeeze", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire7_squeeze", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 48, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["merge_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire7_expand1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire7_expand1", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 192, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire7_squeeze", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire7_expand2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "name": "fire7_expand2", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 192, "activation": "relu", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire7_squeeze", 0, 0]]]}, {"class_name": "Merge", "name": "merge_6", "config": {"output_shape": null, "output_mask": null, "name": "merge_6", "arguments": {}, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw"}, "inbound_nodes": [[["fire7_expand1", 0, 0], ["fire7_expand2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire8_squeeze", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire8_squeeze", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 64, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["merge_6", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire8_expand1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire8_expand1", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 256, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire8_squeeze", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire8_expand2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "name": "fire8_expand2", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 256, "activation": "relu", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire8_squeeze", 0, 0]]]}, {"class_name": "Merge", "name": "merge_7", "config": {"output_shape": null, "output_mask": null, "name": "merge_7", "arguments": {}, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw"}, "inbound_nodes": [[["fire8_expand1", 0, 0], ["fire8_expand2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpool8", "config": {"pool_size": [3, 3], "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpool8"}, "inbound_nodes": [[["merge_7", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire9_squeeze", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire9_squeeze", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 64, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["maxpool8", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire9_expand1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "subsample": [1, 1], "name": "fire9_expand1", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 256, "activation": "relu", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire9_squeeze", 0, 0]]]}, {"class_name": "Convolution2D", "name": "fire9_expand2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "name": "fire9_expand2", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 256, "activation": "relu", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire9_squeeze", 0, 0]]]}, {"class_name": "Merge", "name": "merge_8", "config": {"output_shape": null, "output_mask": null, "name": "merge_8", "arguments": {}, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_mask_type": "raw", "concat_axis": 1, "output_shape_type": "raw"}, "inbound_nodes": [[["fire9_expand1", 0, 0], ["fire9_expand2", 0, 0]]]}, {"class_name": "Dropout", "name": "fire9_dropout", "config": {"trainable": true, "p": 0.5, "name": "fire9_dropout"}, "inbound_nodes": [[["merge_8", 0, 0]]]}, {"class_name": "Convolution2D", "name": "conv10", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "nb_col": 1, "subsample": [1, 1], "name": "conv10", "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "nb_filter": 10, "activation": "linear", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null}, "inbound_nodes": [[["fire9_dropout", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "avgpool10", "config": {"pool_size": [13, 13], "dim_ordering": "tf", "trainable": true, "strides": [13, 13], "border_mode": "same", "name": "avgpool10"}, "inbound_nodes": [[["conv10", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"trainable": true, "name": "flatten"}, "inbound_nodes": [[["avgpool10", 0, 0]]]}, {"class_name": "Dense", "name": "steering_output", "config": {"activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "input_dim": 40, "name": "steering_output", "b_constraint": null}, "inbound_nodes": [[["flatten", 0, 0]]]}, {"class_name": "Dense", "name": "throttle_output", "config": {"activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "input_dim": 40, "name": "throttle_output", "b_constraint": null}, "inbound_nodes": [[["flatten", 0, 0]]]}, {"class_name": "Dense", "name": "speed_output", "config": {"activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "input_dim": 40, "name": "speed_output", "b_constraint": null}, "inbound_nodes": [[["flatten", 0, 0]]]}], "input_layers": [["center_img", 0, 0]], "output_layers": [["steering_output", 0, 0], ["throttle_output", 0, 0], ["speed_output", 0, 0]], "name": "model_1"}}