{"keras_version": "1.2.1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "images", "inbound_nodes": [], "config": {"sparse": false, "name": "images", "batch_input_shape": [null, 3, 90, 320], "input_dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "inbound_nodes": [[["images", 0, 0]]], "config": {"mode": 0, "name": "batchnormalization_1", "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "trainable": true, "beta_regularizer": null, "epsilon": 0.001}}, {"class_name": "Convolution2D", "name": "convolution2d_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"dim_ordering": "tf", "bias": true, "W_regularizer": null, "trainable": true, "name": "convolution2d_1", "b_constraint": null, "activation": "linear", "nb_filter": 3, "nb_row": 5, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "border_mode": "same", "subsample": [1, 1]}}, {"class_name": "ELU", "name": "elu_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_2", "inbound_nodes": [[["elu_1", 0, 0]]], "config": {"dim_ordering": "tf", "bias": true, "W_regularizer": null, "trainable": true, "name": "convolution2d_2", "b_constraint": null, "activation": "linear", "nb_filter": 24, "nb_row": 5, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "border_mode": "same", "subsample": [1, 1]}}, {"class_name": "ELU", "name": "elu_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_3", "inbound_nodes": [[["elu_2", 0, 0]]], "config": {"dim_ordering": "tf", "bias": true, "W_regularizer": null, "trainable": true, "name": "convolution2d_3", "b_constraint": null, "activation": "linear", "nb_filter": 36, "nb_row": 5, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "border_mode": "same", "subsample": [1, 1]}}, {"class_name": "ELU", "name": "elu_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["elu_3", 0, 0]]], "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_4", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"dim_ordering": "tf", "bias": true, "W_regularizer": null, "trainable": true, "name": "convolution2d_4", "b_constraint": null, "activation": "linear", "nb_filter": 48, "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "border_mode": "same", "subsample": [1, 1]}}, {"class_name": "ELU", "name": "elu_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["elu_4", 0, 0]]], "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_5", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"dim_ordering": "tf", "bias": true, "W_regularizer": null, "trainable": true, "name": "convolution2d_5", "b_constraint": null, "activation": "linear", "nb_filter": 64, "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "border_mode": "same", "subsample": [1, 1]}}, {"class_name": "ELU", "name": "elu_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["elu_5", 0, 0]]], "config": {"name": "dropout_3", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"W_regularizer": null, "trainable": true, "input_dim": 17280, "name": "dense_1", "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 512, "b_regularizer": null, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"W_regularizer": null, "trainable": true, "input_dim": 512, "name": "dense_2", "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"W_regularizer": null, "trainable": true, "input_dim": 100, "name": "dense_3", "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0]]], "config": {"W_regularizer": null, "trainable": true, "input_dim": 50, "name": "dense_4", "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "name": "steering_output", "inbound_nodes": [[["dense_4", 0, 0]]], "config": {"W_regularizer": null, "trainable": true, "input_dim": 1, "name": "steering_output", "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "b_constraint": null, "W_constraint": null}}], "input_layers": [["images", 0, 0]], "output_layers": [["steering_output", 0, 0]]}}