{"config": {"input_layers": [["images", 0, 0]], "name": "model_1", "layers": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 3, 90, 320], "name": "images", "sparse": false}, "name": "images", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"axis": -1, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_1", "mode": 0, "gamma_regularizer": null, "epsilon": 0.001}, "name": "batchnormalization_1", "inbound_nodes": [[["images", 0, 0]]], "class_name": "BatchNormalization"}, {"config": {"activation": "linear", "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "nb_filter": 3, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_1", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "convolution2d_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "name": "elu_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "nb_filter": 24, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_2", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "convolution2d_2", "inbound_nodes": [[["elu_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "name": "elu_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "nb_filter": 36, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_3", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "convolution2d_3", "inbound_nodes": [[["elu_2", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "name": "elu_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "name": "dropout_1", "inbound_nodes": [[["elu_3", 0, 0]]], "class_name": "Dropout"}, {"config": {"activation": "linear", "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "nb_filter": 48, "nb_col": 3, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_4", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "convolution2d_4", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "name": "elu_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.25}, "name": "dropout_2", "inbound_nodes": [[["elu_4", 0, 0]]], "class_name": "Dropout"}, {"config": {"activation": "linear", "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_5", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "convolution2d_5", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "name": "elu_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.25}, "name": "dropout_3", "inbound_nodes": [[["elu_5", 0, 0]]], "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["dropout_3", 0, 0]]], "class_name": "Flatten"}, {"config": {"input_dim": 17280, "activation": "linear", "W_regularizer": null, "output_dim": 512, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense"}, {"config": {"input_dim": 512, "activation": "linear", "W_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "Dense"}, {"config": {"input_dim": 100, "activation": "linear", "W_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_3", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "Dense"}, {"config": {"input_dim": 50, "activation": "linear", "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_4", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "Dense"}, {"config": {"input_dim": 1, "activation": "linear", "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "steering_output", "activity_regularizer": null, "b_constraint": null, "bias": true}, "name": "steering_output", "inbound_nodes": [[["dense_4", 0, 0]]], "class_name": "Dense"}], "output_layers": [["steering_output", 0, 0]]}, "keras_version": "1.2.1", "class_name": "Model"}