{"class_name": "Model", "keras_version": "1.2.1", "config": {"input_layers": [["images", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "images", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 3, 90, 320], "name": "images", "input_dtype": "float32"}}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "inbound_nodes": [[["images", 0, 0]]], "config": {"trainable": true, "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "epsilon": 0.001, "beta_regularizer": null, "name": "batchnormalization_1", "axis": -1}}, {"class_name": "Convolution2D", "name": "conv1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 96, "name": "conv1", "W_constraint": null, "nb_row": 7, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 7, "activation": "relu", "subsample": [2, 2], "border_mode": "same"}}, {"class_name": "MaxPooling2D", "name": "maxpool1", "inbound_nodes": [[["conv1", 0, 0]]], "config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [3, 3], "name": "maxpool1", "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire2_squeeze", "inbound_nodes": [[["maxpool1", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 16, "name": "fire2_squeeze", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire2_expand1", "inbound_nodes": [[["fire2_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 64, "name": "fire2_expand1", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire2_expand2", "inbound_nodes": [[["fire2_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 64, "name": "fire2_expand2", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Merge", "name": "merge_1", "inbound_nodes": [[["fire2_expand1", 0, 0], ["fire2_expand2", 0, 0]]], "config": {"arguments": {}, "concat_axis": 1, "output_shape_type": "raw", "output_mask": null, "mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape": null, "output_mask_type": "raw", "name": "merge_1"}}, {"class_name": "Convolution2D", "name": "fire3_squeeze", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 16, "name": "fire3_squeeze", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire3_expand1", "inbound_nodes": [[["fire3_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 64, "name": "fire3_expand1", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire3_expand2", "inbound_nodes": [[["fire3_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 64, "name": "fire3_expand2", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Merge", "name": "merge_2", "inbound_nodes": [[["fire3_expand1", 0, 0], ["fire3_expand2", 0, 0]]], "config": {"arguments": {}, "concat_axis": 1, "output_shape_type": "raw", "output_mask": null, "mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape": null, "output_mask_type": "raw", "name": "merge_2"}}, {"class_name": "Convolution2D", "name": "fire4_squeeze", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 32, "name": "fire4_squeeze", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire4_expand1", "inbound_nodes": [[["fire4_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 128, "name": "fire4_expand1", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire4_expand2", "inbound_nodes": [[["fire4_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 128, "name": "fire4_expand2", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Merge", "name": "merge_3", "inbound_nodes": [[["fire4_expand1", 0, 0], ["fire4_expand2", 0, 0]]], "config": {"arguments": {}, "concat_axis": 1, "output_shape_type": "raw", "output_mask": null, "mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape": null, "output_mask_type": "raw", "name": "merge_3"}}, {"class_name": "MaxPooling2D", "name": "maxpool4", "inbound_nodes": [[["merge_3", 0, 0]]], "config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [3, 3], "name": "maxpool4", "border_mode": "valid"}}, {"class_name": "Convolution2D", "name": "fire5_squeeze", "inbound_nodes": [[["maxpool4", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 32, "name": "fire5_squeeze", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire5_expand1", "inbound_nodes": [[["fire5_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 128, "name": "fire5_expand1", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire5_expand2", "inbound_nodes": [[["fire5_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 128, "name": "fire5_expand2", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Merge", "name": "merge_4", "inbound_nodes": [[["fire5_expand1", 0, 0], ["fire5_expand2", 0, 0]]], "config": {"arguments": {}, "concat_axis": 1, "output_shape_type": "raw", "output_mask": null, "mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape": null, "output_mask_type": "raw", "name": "merge_4"}}, {"class_name": "Convolution2D", "name": "fire6_squeeze", "inbound_nodes": [[["merge_4", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 48, "name": "fire6_squeeze", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire6_expand1", "inbound_nodes": [[["fire6_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 192, "name": "fire6_expand1", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire6_expand2", "inbound_nodes": [[["fire6_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 192, "name": "fire6_expand2", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Merge", "name": "merge_5", "inbound_nodes": [[["fire6_expand1", 0, 0], ["fire6_expand2", 0, 0]]], "config": {"arguments": {}, "concat_axis": 1, "output_shape_type": "raw", "output_mask": null, "mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape": null, "output_mask_type": "raw", "name": "merge_5"}}, {"class_name": "Convolution2D", "name": "fire7_squeeze", "inbound_nodes": [[["merge_5", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 48, "name": "fire7_squeeze", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire7_expand1", "inbound_nodes": [[["fire7_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 192, "name": "fire7_expand1", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire7_expand2", "inbound_nodes": [[["fire7_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 192, "name": "fire7_expand2", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Merge", "name": "merge_6", "inbound_nodes": [[["fire7_expand1", 0, 0], ["fire7_expand2", 0, 0]]], "config": {"arguments": {}, "concat_axis": 1, "output_shape_type": "raw", "output_mask": null, "mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape": null, "output_mask_type": "raw", "name": "merge_6"}}, {"class_name": "Convolution2D", "name": "fire8_squeeze", "inbound_nodes": [[["merge_6", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 64, "name": "fire8_squeeze", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire8_expand1", "inbound_nodes": [[["fire8_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 256, "name": "fire8_expand1", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire8_expand2", "inbound_nodes": [[["fire8_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 256, "name": "fire8_expand2", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Merge", "name": "merge_7", "inbound_nodes": [[["fire8_expand1", 0, 0], ["fire8_expand2", 0, 0]]], "config": {"arguments": {}, "concat_axis": 1, "output_shape_type": "raw", "output_mask": null, "mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape": null, "output_mask_type": "raw", "name": "merge_7"}}, {"class_name": "MaxPooling2D", "name": "maxpool8", "inbound_nodes": [[["merge_7", 0, 0]]], "config": {"trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [3, 3], "name": "maxpool8", "border_mode": "valid"}}, {"class_name": "Convolution2D", "name": "fire9_squeeze", "inbound_nodes": [[["maxpool8", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 64, "name": "fire9_squeeze", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire9_expand1", "inbound_nodes": [[["fire9_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 256, "name": "fire9_expand1", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "fire9_expand2", "inbound_nodes": [[["fire9_squeeze", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 256, "name": "fire9_expand2", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Merge", "name": "merge_8", "inbound_nodes": [[["fire9_expand1", 0, 0], ["fire9_expand2", 0, 0]]], "config": {"arguments": {}, "concat_axis": 1, "output_shape_type": "raw", "output_mask": null, "mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape": null, "output_mask_type": "raw", "name": "merge_8"}}, {"class_name": "Dropout", "name": "fire9_dropout", "inbound_nodes": [[["merge_8", 0, 0]]], "config": {"p": 0.5, "trainable": true, "name": "fire9_dropout"}}, {"class_name": "Convolution2D", "name": "conv10", "inbound_nodes": [[["fire9_dropout", 0, 0]]], "config": {"bias": true, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "trainable": true, "nb_filter": 10, "name": "conv10", "W_constraint": null, "nb_row": 1, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "activation": "linear", "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "AveragePooling2D", "name": "avgpool10", "inbound_nodes": [[["conv10", 0, 0]]], "config": {"trainable": true, "dim_ordering": "tf", "strides": [13, 13], "pool_size": [13, 13], "name": "avgpool10", "border_mode": "same"}}, {"class_name": "Flatten", "name": "flatten", "inbound_nodes": [[["avgpool10", 0, 0]]], "config": {"trainable": true, "name": "flatten"}}, {"class_name": "Dense", "name": "steering_output", "inbound_nodes": [[["flatten", 0, 0]]], "config": {"bias": true, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "input_dim": 40, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "name": "steering_output", "b_constraint": null}}], "output_layers": [["steering_output", 0, 0]]}}